rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
/* Check if Adc_Ipw.c file and DSPSS_Api.h file are of the same Software version */
#if ((ADC_IPW_SW_MAJOR_VERSION_C != DSPSS_SW_MAJOR_VERSION_API) || \
     (ADC_IPW_SW_MINOR_VERSION_C != DSPSS_SW_MINOR_VERSION_API) || \
     (ADC_IPW_SW_PATCH_VERSION_C != DSPSS_SW_PATCH_VERSION_API) \
    )
  #error "Software Version Numbers of Adc_Ipw.c and DSPSS_Api.h are different"
#endif

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */
/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/
#ifdef ADC_DMA_SUPPORTED
#define ADC_IPW_GET_COMPLEMENT_OF_2(x)      ((uint32)(~((uint32)(x)) + 1U))
#endif /* ADC_DMA_SUPPORTED */
/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONST_8
#include "Adc_MemMap.h"

#if ( (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) )

/* Mapping ADC instance to BCTU instance*/
static const uint8 Adc_Ipw_au8AdcIdToCtuId[ADC_IPW_MAX_HW_UNITS] = ADC_IPW_ADC_TO_CTU_MAPPING_ARRAY;

#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) */


#if ( (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) )

/* Offset for mapping some bit fields and registers of BCTU to corresponding ADC instance.
Eg: ADC_SEL0 of BCTU0 using for ADC0 but ADC_SEL0 of BCTU1 is for ADC3 */
static const uint8 Adc_Ipw_au8AdcIndexOffset[ADC_IPW_CTU_MAX_HW_UNITS] = ADC_IPW_ADC_INDEX_OFFSET_BITFIELD_ARRAY;

#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) */

#define ADC_STOP_SEC_CONST_8
#include "Adc_MemMap.h"


/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/
#ifdef ADC_DMA_SUPPORTED
#define ADC_START_SEC_VAR_CLEARED_8_NO_CACHEABLE
#include "Adc_MemMap.h"

/* Internal Buffer filled in by DMA for clear pending HW Dma Request (Adc_Ipw_DmaClearPendingReq). It makes a temp transfer by itself. */
static uint8 Adc_Ipw_u8DmaDraftBuffer;

#define ADC_STOP_SEC_VAR_CLEARED_8_NO_CACHEABLE
#include "Adc_MemMap.h"

#if (ADC_READ_GROUP_API == STD_ON)
#define ADC_START_SEC_CONST_8
#include "Adc_MemMap.h"

/* Available resolutions. */
static const uint8 Adc_Ipw_au8AvailableResolutions[4U] = ADC_IPW_AVAILABLE_RESOLUTIONS;

#define ADC_STOP_SEC_CONST_8
#include "Adc_MemMap.h"
#endif /* (ADC_READ_GROUP_API == STD_ON) */

#define ADC_START_SEC_VAR_CLEARED_32_NO_CACHEABLE
#include "Adc_MemMap.h"
/* Internal Dma Buffer filled in by DMA for groups having Without Interrupts enabled.
Store all 32 bits result data, because it is required to check if last conversion from group has completed in ReadGroup. */
static uint32 Adc_Ipw_au32DmaNoIrqBuffer[ADC_IPW_MAX_HW_UNITS][ADC_MAX_CHANNEL_PER_HW_UNIT];

#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
/* Intermediate buffer is used for Optimize DMA streaming groups to avoid overwriting data in Adc_Ipw_au32DmaNoIrqBuffer of without interrupt groups.
Rationale: Adc_Ipw_au32DmaNoIrqBuffer is used in Adc_ReadGroup for DMA without interrupt groups whereas optimize streaming group has interrupts
and Adc_ReadGroup gets data from user buffer. Therefore, if Adc_Ipw_au32DmaNoIrqBuffer is shared, an normal without interrupt group might lost
converted data in Adc_Ipw_au32DmaNoIrqBuffer before using Adc_ReadGroup for that group when the injected optimize streaming groups starts its own
conversions with different set of channels. */
static uint32 Adc_Ipw_au32DmaIntermediateBuffer[ADC_IPW_MAX_HW_UNITS][ADC_MAX_CHANNEL_PER_HW_UNIT];
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#define ADC_STOP_SEC_VAR_CLEARED_32_NO_CACHEABLE
#include "Adc_MemMap.h"
#endif /* ADC_DMA_SUPPORTED */

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

#if ((ADC_READ_GROUP_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON))
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
static inline Std_ReturnType Adc_Ipw_IsChannelEnable(Adc_HwUnitType LogicalHwUnitId,
                                                     Adc_GroupType GroupId,
                                                     Adc_ChannelType ChIndex,
                                                     uint8 UserId);
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
#endif /* ((ADC_READ_GROUP_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)) */

#if (ADC_READ_GROUP_API == STD_ON)
static inline Adc_Sar_Ip_ChanResultType Adc_Ipw_CalculateLastChan(const Adc_GroupType Group,
                                                                  const Adc_Sar_Ip_ConvChainType ConversionType,
                                                                  const uint8 UserId);

