rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
static inline Std_ReturnType Adc_Ipw_GetChanResultNoInt(const Adc_GroupType Group,
                                                        const Adc_Sar_Ip_ConvChainType ConversionType,
                                                        const uint8 UserId,
                                                        Adc_ValueGroupType * DataPtr,
                                                        boolean * Flag);

static inline Std_ReturnType Adc_Ipw_ReadGroupNoInt(const Adc_GroupType Group,
                                                    Adc_ValueGroupType * DataPtr,
                                                    boolean * Flag,
                                                    uint8 UserId);

static inline Std_ReturnType Adc_Ipw_ReadGroupAdcSar(const Adc_GroupType Group,
                                                     Adc_ValueGroupType * DataPtr,
                                                     boolean * Flag,
                                                     uint8 UserId);
static inline void Adc_Ipw_ReadGroupIntAdcSar(const Adc_GroupType Group,
                                                Adc_ValueGroupType * DataPtr,
                                                uint8 UserId);

#if (ADC_IPW_SDADC_IS_USED == STD_ON)

static inline Std_ReturnType Adc_Ipw_ReadGroupNoIntSdAdc(const Adc_GroupType Group,
                                                         Adc_ValueGroupType * DataPtr,
                                                         boolean * Flag,
                                                         uint8 UserId);

static inline Std_ReturnType Adc_Ipw_ReadGroupSdAdc(const Adc_GroupType Group,
                                                    Adc_ValueGroupType * DataPtr,
                                                    boolean * Flag,
                                                    uint8 UserId);

#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */

#endif /* (ADC_READ_GROUP_API == STD_ON) */

#if ((ADC_HW_TRIGGER_API == STD_ON) && (((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) || (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)))
#ifdef ADC_DMA_SUPPORTED
static inline void Adc_Ipw_DisableHardwareTriggerChannelDma(const Adc_HwUnitType PhysicalHwUnitId, uint32 Group);
#endif
#endif

#ifdef ADC_DMA_SUPPORTED
static inline void Adc_Ipw_DmaClearPendingReq(const uint32 DmaLogicChannel);

static inline uint32 Adc_Ipw_GetDataAddress(const Adc_HwUnitType PhysicalHwUnitId,
                                            const uint8 PhysChannelId);

static inline uint32 Adc_Ipw_GetDataOffset(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                           const Adc_HwUnitType LogicalHwUnitId,
                                           const Adc_HwUnitType PhysicalHwUnitId);

static inline void Adc_Ipw_DisableHardwareTriggerChannelDma(const Adc_HwUnitType PhysicalHwUnitId, uint32 Group);

#if ( (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) )

static inline void Adc_Ipw_SetupTcdSingleAdcChannelMajorLink(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                             const Adc_GroupConfigurationType * const GroupPtr,
                                                             const Adc_HwUnitType PhysicalHwUnitId);

#endif /* (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

static inline void Adc_Ipw_SetupTcdSingleAdcChannelDmaConfig(const uint32 AdcDmaLogicChId,
                                                             const Dma_Ip_LogicChannelTransferListType LocTransferList[],
                                                             const uint32 LocTransferListNumElems);

#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)

static inline uint32 Adc_Ipw_GetDspssThreadOutputBufferLength(const Adc_HwUnitType PhysicalHwUnitId);

static inline void Adc_Ipw_SetupTcdLastSourceAddressOffset(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                           const Adc_GroupConfigurationType * const GroupPtr);

#if ((STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS))

static inline void Adc_Ipw_SetupTcdSingleAdcChannelMinorLink(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                             const Adc_GroupConfigurationType * const GroupPtr);

#endif /* (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */

#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */

static inline void Adc_Ipw_SetupTcdSingleAdcChannel(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                    const Adc_GroupConfigurationType * const GroupPtr,
                                                    uint8 PhysChannelId);

static inline void Adc_Ipw_SetupTcdMultiAdcChannel(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                   const Adc_GroupConfigurationType * const GroupPtr,
                                                   Adc_ChannelIndexType ChannelCount);

static inline void Adc_Ipw_StartDmaOperation(uint8 Unit,
                                             Adc_GroupType Group,
                                             uint8 UserId);

#if (ADC_DEINIT_API == STD_ON)
static inline void Adc_Ipw_DmaClearHwRequest(uint8 UserId,
                                            Adc_HwUnitType LogicalHwUnitId);
#endif /* (ADC_DEINIT_API == STD_ON) */

#if (ADC_READ_GROUP_API == STD_ON)
static void Adc_Ipw_MaskConvResult(uint32 DmaResult,
                                   Adc_Sar_Ip_ChanResultType * const Result,
                                   const boolean SkipValidation,
                                   const uint8 Resolution,
                                   Adc_Sar_Ip_DataAlignedType DataAlignment)
{
    uint32 DmaBufferMask;

    Result->ConvData = 0u;
    Result->ValidFlag = FALSE;
    Result->OverWrittenFlag = FALSE;

    /* Check if the the conversion data is valid */
    if (((DmaResult != ADC_IPW_INVALID_DATA_RESULT_DMA) && ((DmaResult & ADC_CDR_VALID_MASK) != 0U)) || SkipValidation)
    {
        /* The data is correct, store the result in and clear the flag */
        Result->ValidFlag = TRUE;
        Result->OverWrittenFlag = (1U == ((DmaResult & ADC_CDR_OVERW_MASK) >> ADC_CDR_OVERW_SHIFT));
        if (ADC_SAR_IP_DATA_ALIGNED_LEFT == DataAlignment)
        {
            DmaBufferMask = (uint32)ADC_CDR_CDATA_MASK << (16u - Resolution);
            Result->ConvData = (uint16)(DmaResult & DmaBufferMask) >> ADC_CDR_CDATA_SHIFT;
        }
        else
        {
            DmaBufferMask = ((uint32)ADC_CDR_CDATA_MASK >> 1) & ((uint32)ADC_CDR_CDATA_MASK << (ADC_SAR_IP_RESULT_RESOLUTION - Resolution));
            Result->ConvData = ((uint16)(DmaResult & DmaBufferMask)) >> (ADC_SAR_IP_RESULT_RESOLUTION - Resolution + ADC_CDR_CDATA_SHIFT);
        }
    }
}
#endif /* (ADC_READ_GROUP_API == STD_ON) */

