rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
static inline void Adc_Ipw_EnableDMA(Adc_HwUnitType Unit,
                                     uint8 UserId,
                                     Adc_GroupType Group,
                                     const Adc_GroupConfigurationType * GroupPtr);
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
static inline void Adc_Ipw_StartNormalConversionAdcSarDmaEnable(const Adc_HwUnitType Unit,
                                                const uint8 UserId,
                                                const Adc_GroupType Group,
                                                const Adc_GroupConfigurationType * GroupPtr,
                                                const Adc_HwUnitType PhysicalHwUnitId);
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */
#endif /* ADC_DMA_SUPPORTED */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
static inline void Adc_Ipw_InitNcmrMask(const Adc_ConfigType * CfgPtr);
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
static inline void Adc_Ipw_PrepareGroupStart(Adc_HwUnitType Unit,
                                             const Adc_GroupConfigurationType * GroupPtr,
                                             uint8 UserId);
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */

#if ((ADC_IPW_BCTU_AVAILABLE == STD_ON) && (ADC_HW_TRIGGER_API == STD_ON))
static inline Std_ReturnType Adc_Ipw_BctuTriggerEnable(const Adc_GroupType Group,
                                                       Adc_HwTriggerTimerType TriggerSource,
                                                       boolean AutosarApi,
                                                       boolean FirstTrigger,
                                                       uint8 UserId);
#endif /* ((ADC_IPW_BCTU_AVAILABLE == STD_ON) && (ADC_HW_TRIGGER_API == STD_ON)) */

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
static void Adc_Ipw_StartNormalConversionAdcSar(const Adc_HwUnitType Unit,
                                                const uint8 UserId,
                                                const Adc_GroupType Group,
                                                const Adc_GroupConfigurationType * GroupPtr,
                                                const Adc_HwUnitType PhysicalHwUnitId);

static Std_ReturnType Adc_Ipw_StopCurrentConversionAdcSar(Adc_HwUnitType Unit,
                                                          Adc_GroupType Group,
                                                          uint8 UserId,
                                                          Adc_HwUnitType PhysicalHwUnitId);
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
static inline  Std_ReturnType Adc_Ipw_ConfigureThresholdAdcSar(const Adc_ThresholdControlIndexType ThresholdControlIndex,
                                                               const Adc_ValueGroupType LowValue,
                                                               const Adc_ValueGroupType HighValue,
                                                               const uint8 UserId);
#endif /* (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON) */

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
static inline void Adc_Ipw_StartNormalConversionSdAdcClearFifo(const Adc_HwUnitType PhysicalHwUnitId);

static void Adc_Ipw_StartNormalConversionSdAdc(const Adc_HwUnitType Unit,
                                               const uint8 UserId,
                                               const Adc_GroupType Group,
                                               const Adc_GroupConfigurationType * GroupPtr,
                                               const Adc_HwUnitType PhysicalHwUnitId);

static Std_ReturnType Adc_Ipw_StopCurrentConversionSdAdc(Adc_HwUnitType Unit,
                                                         Adc_GroupType Group,
                                                         uint8 UserId,
                                                         Adc_HwUnitType PhysicalHwUnitId);
#endif /* ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON)) */

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
static inline Std_ReturnType Adc_Ipw_ConfigureThresholdSdAdc(const Adc_ThresholdControlIndexType ThresholdControlIndex,
                                                             const Adc_ValueGroupType LowValue,
                                                             const Adc_ValueGroupType HighValue,
                                                             const uint8 UserId);
#endif /* (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON) */
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */


#if (ADC_HW_TRIGGER_API == STD_ON)

static inline Std_ReturnType Adc_Ipw_EnableHardwareTriggerAdcSar(const Adc_GroupType Group,
                                                                 const Adc_HwUnitType Unit,
                                                                 const uint8 UserId);

static inline void Adc_Ipw_DisableHardwareTriggerAdcSar(const Adc_GroupType Group,
                                                        const Adc_HwUnitType Unit,
                                                        const uint8 UserId);

#if (ADC_IPW_SDADC_IS_USED == STD_ON)

static inline Std_ReturnType Adc_Ipw_EnableHardwareTriggerSdAdc(const Adc_GroupType Group,
                                                                const Adc_HwUnitType Unit,
                                                                const uint8 UserId);

static inline void Adc_Ipw_DisableHardwareTriggerSdAdc(const Adc_GroupType Group,
                                                       const Adc_HwUnitType Unit,
                                                       const uint8 UserId);

#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */

#endif /* (ADC_HW_TRIGGER_API == STD_ON) */


