rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    return ReturnValue;
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
#endif /* ((ADC_READ_GROUP_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)) */

#if (ADC_READ_GROUP_API == STD_ON)
/**
* @brief          This function calculates last channel in group and return its struct value.
* @details        This function calculates last channel in group and return its struct value.
*
* @param[in]      Group                 Group index.
* @param[in]      ConversionType        Group conversion type (normal/inject/CTU).
* @param[in]      UserId                User Id.
*
* @return         AdcResultLastCh       Last channel result struct.
*
*/
static inline Adc_Sar_Ip_ChanResultType Adc_Ipw_CalculateLastChan(const Adc_GroupType Group,
                                                                  const Adc_Sar_Ip_ConvChainType ConversionType,
                                                                  const uint8 UserId)
{
    Adc_Sar_Ip_ChanResultType AdcResultLastCh;
    Adc_ChannelType LastCh;
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcLogicalUnitId;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
#if ((ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_OFF))
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]); /* Pointer to AdcGroup */
#endif
#ifdef ADC_DMA_SUPPORTED
    uint8 Res;
    const Adc_Sar_Ip_DataAlignedType DataAlign = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->DataAlign;
#endif /* ADC_DMA_SUPPORTED */
#if ((ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON))
    Adc_ChannelIndexType ChannelCount;
#endif
#if ((ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_SETCHANNEL_API == STD_ON))
    Adc_ChannelIndexType Channel;
    const Adc_Sar_Ip_ConfigType * AdcPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId];
    #if (ADC_SETCHANNEL_API == STD_ON)
        Adc_ChannelType CrtChannel;
    #else
        Std_ReturnType ChannelEnable = (Std_ReturnType)E_NOT_OK;
        Std_ReturnType ChannelExist = (Std_ReturnType)E_NOT_OK;
        Adc_GroupType GroupId = ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX;
        Adc_ChannelType ChIndex;
    #endif /* (ADC_SETCHANNEL_API == STD_ON) */
#endif

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
#else
    #if ((ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || defined(ADC_DMA_SUPPORTED))
        ChannelCount = GroupPtr->AssignedChannelCount;
    #endif
#endif

    /* Without interrupts the caller doesn't know if all the conversions in the group have completed
    So first need to check if the result is valid (completed) for the channel with largest physical index (last channel),
    because ADC_SAR executes conversions in ascending order of channel index.
    If yes, then read all the channels. */
#if (ADC_SETCHANNEL_API == STD_ON)
    LastCh = AdcPtr->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[0]].ChanIndex;
    for (Channel = 1U; Channel < ChannelCount; Channel++)
    {
        CrtChannel = AdcPtr->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[Channel]].ChanIndex;
        if (CrtChannel > LastCh)
        {
            /* Calculate the last channel to configure DMA when SetChannel function is invoked */
            LastCh = CrtChannel;
        }
    }
#else
    LastCh = (Adc_ChannelType)GroupPtr->LastCh;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /* Get index of the group with AdcEnableChDisableChGroup enabled */
    GroupId = (Adc_GroupType)GroupPtr->EnableChDisableChGroupIndex;
    /* Check if group have AdcEnableChDisableChGroup enabled */
    if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupId)
    {
        for (Channel = 0U; Channel < ChannelCount; Channel++)
        {
            ChIndex = GroupPtr->AssignmentPtr[Channel];
            ChannelEnable = Adc_Ipw_IsChannelEnable(LogicalHwUnitId, GroupId, ChIndex, UserId);
            if ((Std_ReturnType)E_OK == ChannelEnable)
            {
                if ((Std_ReturnType)E_NOT_OK == ChannelExist)
                {
                    ChannelExist = (Std_ReturnType)E_OK;
                    LastCh = AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex;
                }
                if (AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex > LastCh)
                {
                    /* Calculate the last channel to check convert status when disableChannel function is invoked */
                    LastCh = AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex;
                }
            }
        }
    }
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

    /* Initialize the value for AdcResultLastCh*/
    AdcResultLastCh.ConvData = 0U;
    AdcResultLastCh.AdcChnIdx = (uint8)LastCh;
    AdcResultLastCh.ValidFlag = FALSE;
    AdcResultLastCh.OverWrittenFlag = FALSE;

#ifdef ADC_DMA_SUPPORTED
    if ((ADC_DMA != Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) || (TRUE == GroupPtr->AdcWithoutDma))
    {
#endif /*ADC_DMA_SUPPORTED*/
        Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, LastCh, ConversionType, &AdcResultLastCh);
#ifdef ADC_DMA_SUPPORTED
    }
    else
    {
        /* If BypassResolution enabled, number of bits in results always are 15 even the resolution is lower than. */
        if (FALSE == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->BypassResolution)
        {
            Res = Adc_Ipw_au8AvailableResolutions[(uint8)(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->AdcResolution)];
        }
        else
        {
            Res = ADC_SAR_IP_RESULT_RESOLUTION;
        }
        if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
        {
            Adc_Ipw_MaskConvResult(Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][ChannelCount - 1U], &AdcResultLastCh, FALSE, Res, DataAlign);
        }
        else
        {
            if (ADC_IPW_INVALID_DATA_RESULT_DMA != Adc_axGroupStatus[Group].ResultsBufferPtr[ChannelCount - 1U])
            {
                Adc_Ipw_MaskConvResult((uint32)Adc_axGroupStatus[Group].ResultsBufferPtr[ChannelCount - 1U], &AdcResultLastCh, TRUE, Res, DataAlign);
            }
        }
    }
#endif /*ADC_DMA_SUPPORTED*/

    return AdcResultLastCh;
}

/**
* @brief          This function records conversion result of channels in group.
* @details        This function records conversion result of channels in group.
*
* @param[in]      Group                Group index.
* @param[in]      ConversionType       Group conversion type (normal/inject/CTU).
* @param[in]      UserId               User Id.
* @param[out]     DataPtr              Pointer to a buffer which will be filled by the conversion results.
* @param[out]     Flag                 Pointer to limit check flag
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              Channel result is valid.
* @retval         E_NOT_OK          Channel result is invalid.
*
*/
static inline Std_ReturnType Adc_Ipw_GetChanResultNoInt(const Adc_GroupType Group,
                                                        const Adc_Sar_Ip_ConvChainType ConversionType,
                                                        const uint8 UserId,
                                                        Adc_ValueGroupType * DataPtr,
                                                        boolean * Flag)
{
    Adc_Sar_Ip_ChanResultType AdcResultLastCh;
    Adc_ChannelIndexType Channel;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    Std_ReturnType ChannelEnable = (Std_ReturnType)E_NOT_OK;
    Adc_GroupType GroupId = ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX;
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
    Adc_ChannelType ChIndex;
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    const Adc_Sar_Ip_ConfigType * AdcPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId];
#ifdef ADC_DMA_SUPPORTED
    uint8 Res;
    const Adc_Sar_Ip_DataAlignedType DataAlign = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->DataAlign;
#endif /* ADC_DMA_SUPPORTED */
    Std_ReturnType ReadGroupRet = (Std_ReturnType)E_OK;
    Adc_ChannelIndexType ChannelCount;
    Adc_Sar_Ip_ChanResultType AdcResult;
    uint16 ConvData;
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    /* Flag to set if ADC results are in the selected range */
    boolean WriteFlag = TRUE;
#ifdef ADC_DMA_SUPPORTED
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
    const uint32 AdcDmaLogicChId = (uint32) Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
#endif /*ADC_DMA_SUPPORTED*/
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
#else
    ChannelCount = GroupPtr->AssignedChannelCount;
#endif

#ifdef ADC_DMA_SUPPORTED
    /* If BypassResolution enabled, number of bits in results always are 15 even the resolution is lower than. */
    if (FALSE == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->BypassResolution)
    {
        Res = Adc_Ipw_au8AvailableResolutions[(uint8)(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->AdcResolution)];
    }
    else
    {
        Res = ADC_SAR_IP_RESULT_RESOLUTION;
    }
#endif /*ADC_DMA_SUPPORTED*/

    AdcResultLastCh = Adc_Ipw_CalculateLastChan(Group, ConversionType, UserId);
    if (TRUE == AdcResultLastCh.ValidFlag)
    {
        /* Result for LastCh is valid, so all conversions from the group have been completed */
        for (Channel = 0U; Channel < ChannelCount; Channel++)
        {
#if (ADC_SETCHANNEL_API == STD_ON)
            ChIndex = Adc_axRuntimeGroupChannel[Group].ChannelPtr[Channel];
#else
            ChIndex = GroupPtr->AssignmentPtr[Channel];
#endif
            if ((uint32)AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex != AdcResultLastCh.AdcChnIdx)
            {
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
                /* Get index of the group with AdcEnableChDisableChGroup enabled */
                GroupId = (Adc_GroupType) GroupPtr->EnableChDisableChGroupIndex;
                /* Check if group have AdcEnableChDisableChGroup enabled */
                if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupId)
                {
                    ChannelEnable = Adc_Ipw_IsChannelEnable(LogicalHwUnitId, GroupId, ChIndex, UserId);
                }
                else
                {
                    ChannelEnable = (Std_ReturnType)E_OK;
                }
                /* If channel is enabled, check valid and result bit */
                if ((Std_ReturnType)E_OK == ChannelEnable)
                {
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
#ifdef ADC_DMA_SUPPORTED
                    if ((ADC_DMA != Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) || (TRUE == GroupPtr->AdcWithoutDma))
                    {
#endif /*ADC_DMA_SUPPORTED*/
                        Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), ConversionType, &AdcResult);
#ifdef ADC_DMA_SUPPORTED
                    }
                    else
                    {
                        if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
                        {
                            Adc_Ipw_MaskConvResult(Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][Channel], &AdcResult, FALSE, Res, DataAlign);
                        }
                        else
                        {
                            Adc_Ipw_MaskConvResult((uint32)Adc_axGroupStatus[Group].ResultsBufferPtr[Channel], &AdcResult, TRUE, Res, DataAlign);
                        }
                    }
#endif /*ADC_DMA_SUPPORTED*/

