rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
                    if (FALSE == AdcResult.ValidFlag)
                    {
                        ReadGroupRet = (Std_ReturnType)E_NOT_OK;
                        break;
                    }
                    ConvData = AdcResult.ConvData;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
                }
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
            }
            else
            {
                /* For LastChan do not read again the result, but use the result already read */
                ConvData = AdcResultLastCh.ConvData;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
                /* The Last Channel is always enabled */
                ChannelEnable = (Std_ReturnType)E_OK;
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
            }

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
            if ((Std_ReturnType)E_OK == ChannelEnable)
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
            {
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
                if ((TRUE == GroupPtr->AdcGroupLimitcheck)
#if (ADC_SETCHANNEL_API == STD_ON)
                    || (TRUE == Adc_axRuntimeGroupChannel[Group].AdcRuntimeGroupLimitcheck)
#endif /* ADC_SETCHANNEL_API == STD_ON */
                   )
                {
                    (*Flag) = Adc_Ipw_CheckConversionValuesInRange(ConvData, LogicalHwUnitId, ChIndex, UserId);
                    if (FALSE == (*Flag))
                    {
                        /* SWS_Adc_00448, SWS_Adc_00449, SWS_Adc_00450 */
                        Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;
                        ReadGroupRet = (Std_ReturnType)E_NOT_OK;
                        WriteFlag = FALSE;
#ifdef ADC_DMA_SUPPORTED
                        if ((ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) && ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable))
                        {
                            /* If the Result Conversion is out of range, need to reset Destination Address to previous Buffer Address. */
                            /* Because the Destination Offset for Streaming Group that has one channel configured be 4U to reducing additional in the callback. */
                            if (GroupPtr->AccessMode == ADC_ACCESS_MODE_STREAMING)
                            {
                                LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
                                LocTransferList[0].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]));
                                (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
                            }
                        }
#endif /*ADC_DMA_SUPPORTED*/
                    }
                    else
                    {
                        Adc_axGroupStatus[Group].LimitCheckFailed = FALSE;
                    }
                }
                if (TRUE == WriteFlag)
#else
                (*Flag) = TRUE;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
                {
                    DataPtr[Channel] = ConvData;
                }
            }
        }
#ifdef ADC_DMA_SUPPORTED
        if ((ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) && (GroupPtr->AdcWithoutDma == FALSE))
        {
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                /* Because all conversions were completed so need to reset last buffer to invalid value before starting next conversion */
                Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][(ChannelCount - 1U)] = ADC_IPW_INVALID_DATA_RESULT_DMA;
            }
            else
            {
                Adc_axGroupStatus[Group].ResultsBufferPtr[(ChannelCount - 1U)] = ADC_IPW_INVALID_DATA_RESULT_DMA;
            }
        }
#endif /* ADC_DMA_SUPPORTED */
    }
    else
    {
        ReadGroupRet = (Std_ReturnType)E_NOT_OK;
    }

    return ReadGroupRet;
}

/**
* @brief          This function reads the converted data for the requested group without interrupt.
* @details        Reads the converted data for the requested group.
*
* @param[in]      Group           The group number.
* @param[out]     DataPtr         Pointer to a buffer which will be filled by the conversion results.
* @param[out]     Flag            Pointer to limit check flag
* @param[in]      UserId          Current UserId.
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successful read of the converted data.
* @retval         E_NOT_OK        In case of an ongoing conversion.
*/
static inline Std_ReturnType Adc_Ipw_ReadGroupNoInt(const Adc_GroupType Group,
                                                    Adc_ValueGroupType * DataPtr,
                                                    boolean * Flag,
                                                    uint8 UserId)
{
    Std_ReturnType ReadGroupRet = (Std_ReturnType)E_OK;
    Adc_Sar_Ip_ConvChainType ConversionType;
    boolean bCompletedConvChain = FALSE;
    uint32 IsrFlags = 0U;
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];

    IsrFlags = Adc_Sar_Ip_GetStatusFlags(PhysicalHwUnitId);
#if (ADC_HW_TRIGGER_API == STD_ON)
    if ((ADC_TRIGG_SRC_SW != GroupPtr->TriggerSource) && (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType) ADC_IPW_MAX_CTU_TRIG_SOURCE_ID))
    {
        ConversionType = ADC_SAR_IP_CONV_CHAIN_CTU;
        if ((IsrFlags & ADC_SAR_IP_NOTIF_FLAG_CTU_EOC) != 0U)
        {
            bCompletedConvChain = TRUE;
        }
    }
    else
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    {
        ConversionType = (Adc_Sar_Ip_ConvChainType)GroupPtr->Type;
        if (((ADC_SAR_IP_CONV_CHAIN_NORMAL == ConversionType) && ((IsrFlags & ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN) != 0U)) || \
            ((ADC_SAR_IP_CONV_CHAIN_INJECTED == ConversionType) && ((IsrFlags & ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN) != 0U)) \
           )
        {
            bCompletedConvChain = TRUE;
        }
    }

    if (TRUE == bCompletedConvChain)
    {
        ReadGroupRet = Adc_Ipw_GetChanResultNoInt(Group, ConversionType, UserId, DataPtr, Flag);
    }
    else
    {
        ReadGroupRet = (Std_ReturnType)E_NOT_OK;
    }

