rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    return ReadGroupRet;
}
#endif /* (ADC_READ_GROUP_API == STD_ON) */

#ifdef ADC_DMA_SUPPORTED
static inline void Adc_Ipw_DmaClearPendingReq(const uint32 DmaLogicChannel)
{
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[12U];

    /* Prepare for Software TCD Configuration:
    0. Source Address (SADDR): Address of Draft Buffer.
    1. Source Transfer Size (SSIZE): Number of bytes to read each time.
    2. Source Address Offset (SOFF): Each source read is completed,
        this value will be added to the current source address (Signed).
    3. Destination Address (DADDR): Address of Draft Buffer (same with SADDR)
    4. Destination Transfer Size (DSIZE): Number of bytes to write each time.
    5. Destination Address Offset (DOFF): Each destination write is completed,
        this value will be added to the current destination address (Signed).
    6. Minor Loop Size (NBYTES): number of bytes to transfer per service request.
    7. Major Loop Count (CITER): Number of minor loop in a major loop.
    8. Start to Transfer by Software (TCDn_CSR.START).
    9. Enable Major Interrupt (INTMAJOR): Enable Interrupt If Major count complete.
    10. Enable Half Major Interrupt (INTHALF): Enable Interrupt If Major Counter Half-complete
    11. Disable Automatic Hardware Request (DREQ): clear automatically the ERQ bit.
    */
    LocTransferList[0].Param = DMA_IP_CH_SET_SOURCE_ADDRESS;
    LocTransferList[0].Value = (uint32)&Adc_Ipw_u8DmaDraftBuffer;
    LocTransferList[1].Param = DMA_IP_CH_SET_SOURCE_TRANSFER_SIZE;
    LocTransferList[1].Value = (uint32)0U; /* 1 Bytes */
    LocTransferList[2].Param = DMA_IP_CH_SET_SOURCE_SIGNED_OFFSET;
    LocTransferList[2].Value = (uint32)0U;
    LocTransferList[3].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
    LocTransferList[3].Value = (uint32)&Adc_Ipw_u8DmaDraftBuffer;
    LocTransferList[4].Param = DMA_IP_CH_SET_DESTINATION_TRANSFER_SIZE;
    LocTransferList[4].Value = (uint32)0U; /* 1 Bytes */
    LocTransferList[5].Param = DMA_IP_CH_SET_DESTINATION_SIGNED_OFFSET;
    LocTransferList[5].Value = (uint32)0U;
    LocTransferList[6].Param = DMA_IP_CH_SET_MINORLOOP_SIZE;
    LocTransferList[6].Value = (uint32)1U; /* 1 Bytes*/
    LocTransferList[7].Param = DMA_IP_CH_SET_MAJORLOOP_COUNT;
    LocTransferList[7].Value = (uint32)1U;
    LocTransferList[8].Param = DMA_IP_CH_SET_CONTROL_SOFTWARE_REQUEST;
    LocTransferList[8].Value = 0U; /* FALSE */
    LocTransferList[9].Param = DMA_IP_CH_SET_CONTROL_EN_MAJOR_INTERRUPT;
    LocTransferList[9].Value = 0U; /* FALSE */
    LocTransferList[10].Param = DMA_IP_CH_SET_CONTROL_EN_HALF_MAJOR_INTERRUPT;
    LocTransferList[10].Value = 0U; /* FALSE */
    LocTransferList[11].Param = DMA_IP_CH_SET_CONTROL_DIS_AUTO_REQUEST;
    LocTransferList[11].Value = 1U; /* TRUE */

    (void)Dma_Ip_SetLogicChannelTransferList(DmaLogicChannel, LocTransferList, 12U);
    (void)Dma_Ip_SetLogicChannelCommand(DmaLogicChannel, DMA_IP_CH_SET_HARDWARE_REQUEST);
    (void)Dma_Ip_SetLogicChannelCommand(DmaLogicChannel, DMA_IP_CH_SET_SOFTWARE_REQUEST);
    /* Major Elink bit only enabled when DONE bit is cleared */
    (void)Dma_Ip_SetLogicChannelCommand(DmaLogicChannel, DMA_IP_CH_CLEAR_DONE);
}


static inline uint32 Adc_Ipw_GetDataAddress(const Adc_HwUnitType PhysicalHwUnitId,
                                            const uint8 PhysChannelId)
{
    uint32 DataAddress;

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        DataAddress = Sdadc_Ip_GetDataAddress((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        DataAddress = Adc_Sar_Ip_GetDataAddress(PhysicalHwUnitId, PhysChannelId);
    }

    return DataAddress;
}


static inline uint32 Adc_Ipw_GetDataOffset(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                           const Adc_HwUnitType LogicalHwUnitId,
                                           const Adc_HwUnitType PhysicalHwUnitId)
{
    /* The source offset is no needed for AdcSar and Sdadc Fifo. Only apply for SdAdc with DSPSS enabled */
    uint32 DataOffset = 0U;

#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
    /* Check if this unit is SDADC with DSPSS enabled */
    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        if (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
        {
            /* Auto add 2 to get next address in the DSPSS Dma read buffer */
            DataOffset = (uint32)2U;
        }
    }
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */

    /* Avoid compiler warnings */
    (void)AdcIpwConfigPtr;
    (void)LogicalHwUnitId;
    (void)PhysicalHwUnitId;

    return DataOffset;
}


#if ( (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) )

static inline void Adc_Ipw_SetupTcdSingleAdcChannelMajorLink(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                             const Adc_GroupConfigurationType * const GroupPtr,
                                                             const Adc_HwUnitType PhysicalHwUnitId)
{
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const uint32 AdcDmaLogicChId         = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    /* Link to counting DMA channel to transfer results from Adc_Ipw_au32DmaNoIrqBuffer to buffer setup by user.
     Use extra transfer via Adc_Ipw_au32DmaNoIrqBuffer to allow usage of ReadGroup */
    const uint32 AdcCountingDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[LogicalHwUnitId];

    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[2U];
    uint32 MajorLinkEnable = 0U;  /* FALSE */

    if (
         (
            /* Stream without interrupt */
           ((uint8)STD_ON             == GroupPtr->AdcWithoutInterrupt) &&
           (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
         )
#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
         ||
         (
            /* Stream optimized DMA with DSPSS enabled */
           (TRUE == GroupPtr->AdcOptimizeDmaStream) &&
           (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) &&
           (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
         )
#endif /* STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS */
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */
       )
    {
        MajorLinkEnable = 1U;  /* TRUE */
    }

    /* Configure major linking */
    LocTransferList[0U].Param = DMA_IP_CH_SET_MAJORLOOP_EN_LINK;
    LocTransferList[0U].Value = MajorLinkEnable;
    LocTransferList[1U].Param = DMA_IP_CH_SET_MAJORLOOP_LOGIC_LINK_CH;
    LocTransferList[1U].Value = AdcCountingDmaLogicChId;

    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 2U);

    /* Avoid compiler warning */
    (void)PhysicalHwUnitId;
}

