rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#endif /* (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */


#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)

static inline uint32 Adc_Ipw_GetDspssThreadOutputBufferLength(const Adc_HwUnitType PhysicalHwUnitId)
{
    /* Get thread output buffer length*/
    return DSPSS_ThreadGetOutputBufferLength((uint32)PhysicalHwUnitId);
}

static inline void Adc_Ipw_SetupTcdLastSourceAddressOffset(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                           const Adc_GroupConfigurationType * const GroupPtr)
{
    const Adc_HwUnitType LogicalHwUnitId  = GroupPtr->AdcLogicalUnitId;
    const uint32 AdcDmaLogicChId          = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    const Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    uint32 LastSourceAddressOffset        = 0U;  /* Initial value is 0 to disable adjustment if it was previously used for another group */
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];

    /* Check if this unit is SDADC with DSPSS enabled */
    if ( (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) &&
         (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
       )
    {
        /* Check if this group is in without interrupt mode or optimized DMA */
        if (
              ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
              ||
              (TRUE == GroupPtr->AdcOptimizeDmaStream)
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
           )
        {
            /* Adjust last source address to the beginning of DSPSS output buffer */
            LastSourceAddressOffset = ADC_IPW_GET_COMPLEMENT_OF_2(Adc_Ipw_GetDspssThreadOutputBufferLength(PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET));
        }
    }

    /* Setup last source address offset */
    LocTransferList[0U].Param = DMA_IP_CH_SET_SOURCE_SIGNED_LAST_ADDR_ADJ;
    LocTransferList[0U].Value = LastSourceAddressOffset;

    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
}

#if ((STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS))

static inline void Adc_Ipw_SetupTcdSingleAdcChannelMinorLink(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                             const Adc_GroupConfigurationType * const GroupPtr)
{
    const Adc_HwUnitType LogicalHwUnitId  = GroupPtr->AdcLogicalUnitId;
    const uint32 AdcDmaLogicChId          = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    const Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    const uint32 AdcCountingDmaLogicChId  = AdcIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[LogicalHwUnitId];

    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[2U];
    uint32 LocTransferListNumElems = 1U;
    uint32 MinorLinkEnable         = 0U;  /* Initial value is FALSE to disable linking if it was previously enabled for another group */

    /* Check if this unit is SDADC with DSPSS enabled */
    if ( (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) &&
         (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
       )
    {
        /* Check if this group is in circular access mode without interrupt OR optimized DMA mode */
        if (
             (
               ((uint8)STD_ON             == GroupPtr->AdcWithoutInterrupt) &&
               (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
             )
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
             ||
             (
               (TRUE == GroupPtr->AdcOptimizeDmaStream)
             )
#endif /* STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS */
           )
        {
            MinorLinkEnable  = 1U; /* TRUE */
        }
    }

    /* Setup minor linking */
    LocTransferList[0U].Param = DMA_IP_CH_SET_MINORLOOP_EN_LINK;
    LocTransferList[0U].Value = MinorLinkEnable;
    /* Only configure link channel number in case minor linking is enabled to avoid impacting BITER value */
    if (0U != MinorLinkEnable)
    {
        LocTransferList[1U].Param = DMA_IP_CH_SET_MINORLOOP_LOGIC_LINK_CH;
        LocTransferList[1U].Value = AdcCountingDmaLogicChId;
        LocTransferListNumElems   = 2U;
    }

    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, LocTransferListNumElems);
}

#endif /* (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */


static inline void Adc_Ipw_SetupTcdSingleAdcChannel(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                    const Adc_GroupConfigurationType * const GroupPtr,
                                                    uint8 PhysChannelId)
{
    const uint32 LocTransferListNumElems = 13U;
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[13U];
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    const Adc_GroupType Group = GroupPtr->GroupId;
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    const Adc_StreamNumSampleType GroupNumSample = GroupPtr->NumSamples;
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */

    /* Prepare for Software TCD Configuration:
    0. Source Address (SADDR): Starting address of the first ADC channel.
    1. Source Transfer Size (SSIZE): Number of bytes to read each time.
    2. Source Address Offset (SOFF): Each source read is completed,
        this value will be added to the current source address (Signed).
    3. Destination Address (DADDR): Address of Group Buffer.
    4. Destination Transfer Size (DSIZE): Number of bytes to write each time.
    5. Destination Address Offset (DOFF): Each destination write is completed,
        this value will be added to the current destination address (Signed).
    6. Minor Loop Size (NBYTES): number of bytes to transfer per service request.
    7. Major Loop Count (CITER): Number of minor loop in a major loop.
    8. Start to Transfer by Software (TCDn_CSR.START).
    9. Enable Major Interrupt (INTMAJOR): Enable Interrupt If Major count complete.
    10. Enable Half Major Interrupt (INTHALF): Enable Interrupt If Major Counter Half-complete
    11. Disable Automatic Hardware Request (DREQ): clear automatically the ERQ bit.
    Other fields upto type of the group:
    - The Destination Signed Last Address Adjustment (DLAST_SGA): The DADDR will be calculated automatically when a major done.
    - The Major Loop Enable Link (TCDn_BITER_ELINKYES.ELINK): Enable Linking Channel
    - The Major Loop Logic Channel Link (TCDn_BITER_ELINKYES.LINKCH): The DMA Channel Logic ID
    */
    LocTransferList[0].Param = DMA_IP_CH_SET_SOURCE_ADDRESS;
    LocTransferList[0].Value = Adc_Ipw_GetDataAddress(PhysicalHwUnitId, PhysChannelId);
    LocTransferList[1].Param = DMA_IP_CH_SET_SOURCE_TRANSFER_SIZE;
    LocTransferList[1].Value = DMA_IP_TRANSFER_SIZE_2_BYTE;
    LocTransferList[2].Param = DMA_IP_CH_SET_SOURCE_SIGNED_OFFSET;
    LocTransferList[2].Value = Adc_Ipw_GetDataOffset(AdcIpwConfigPtr, LogicalHwUnitId, PhysicalHwUnitId);
    LocTransferList[3].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
    LocTransferList[3].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[0]));
    LocTransferList[4].Param = DMA_IP_CH_SET_DESTINATION_TRANSFER_SIZE;
    LocTransferList[4].Value = DMA_IP_TRANSFER_SIZE_2_BYTE;
    LocTransferList[5].Param = DMA_IP_CH_SET_DESTINATION_SIGNED_OFFSET;
    if (GroupPtr->AccessMode == ADC_ACCESS_MODE_STREAMING)
    {
        LocTransferList[5].Value = (uint32)2U; /* Auto add 2 bytes to get address of next Result Buffer */
    }
    else
    {
        LocTransferList[5].Value = (uint32)0U; /* Single Sample doesn't need this offset. */
    }
    LocTransferList[6].Param = DMA_IP_CH_SET_MINORLOOP_SIZE;
    LocTransferList[6].Value = (uint32)2U; /* 2 Bytes*/
    LocTransferList[7].Param = DMA_IP_CH_SET_MAJORLOOP_COUNT;
    LocTransferList[7].Value = (uint32)1U;
    LocTransferList[8].Param = DMA_IP_CH_SET_CONTROL_SOFTWARE_REQUEST;
    LocTransferList[8].Value = 0U; /* FALSE */
    LocTransferList[9].Param = DMA_IP_CH_SET_CONTROL_EN_MAJOR_INTERRUPT;
    LocTransferList[9].Value = 1U; /* TRUE */
    LocTransferList[10].Param = DMA_IP_CH_SET_CONTROL_EN_HALF_MAJOR_INTERRUPT;
    LocTransferList[10].Value = 0U; /* FALSE */
    LocTransferList[11].Param = DMA_IP_CH_SET_CONTROL_DIS_AUTO_REQUEST;
    LocTransferList[11].Value = 1U; /* TRUE */
    LocTransferList[12].Param = DMA_IP_CH_SET_DESTINATION_SIGNED_LAST_ADDR_ADJ;
    LocTransferList[12].Value = (uint32)0U;

#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    if (TRUE == GroupPtr->AdcOptimizeDmaStream)
    {
        /* Overwrite settings for optimized mode */
#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
            if ( (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) &&
                 (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
               )
            {
                /* Overwrite settings for SDADC with DSPSS enabled */
                LocTransferList[3].Value  = (uint32)(&(Adc_Ipw_au32DmaIntermediateBuffer[PhysicalHwUnitId][0U]));
                LocTransferList[5].Value  = 0U;                             /* No increment, because only one channel is continuously transferred into one element in the intermediate buffer */
                LocTransferList[7].Value  = Adc_Ipw_GetDspssThreadOutputBufferLength(PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) >> 1U;  /* Major count = Number of samples (1 sample = 2 bytes) */
                LocTransferList[9].Value  = 0U;                             /* FALSE: major interrupt disabled */
                LocTransferList[11].Value = 0U;                             /* FALSE: keep hardware request enabled */
            }
            else
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */
            {
                /* Overwrite settings for other cases (e.g. ADCSAR and SDADC with DSPSS disabled) */
                LocTransferList[7].Value  = (uint32)GroupNumSample;                                     /* DMA_IP_CH_SET_MAJORLOOP_COUNT */
                LocTransferList[10].Value = GroupPtr->HalfInterrupt ? 1U : 0U;                          /* DMA_IP_CH_SET_CONTROL_EN_HALF_MAJOR_INTERRUPT */
                LocTransferList[12].Value = ADC_IPW_GET_COMPLEMENT_OF_2((uint32)GroupNumSample << 1U);  /* DMA_IP_CH_SET_DESTINATION_SIGNED_LAST_ADDR_ADJ */
            }
    }
    else
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
    {
        if ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt)
        {
            /* Common settings for without interrupt mode */
            LocTransferList[3].Value  = (uint32)(&(Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][0U]));
            LocTransferList[5].Value  = 0U; /* No needed, because only one channel is continuously transferred into one element in the internal buffer */
            LocTransferList[9].Value  = 0U; /* FALSE */
            LocTransferList[11].Value = 0U; /* FALSE */

#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
            if ( (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) &&
                 (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
               )
            {
                /* Overwrite settings for SDADC with DSPSS enabled */
                LocTransferList[1].Value = DMA_IP_TRANSFER_SIZE_2_BYTE;    /* DMA_IP_CH_SET_SOURCE_TRANSFER_SIZE     : Read 2 bytes from XMEM */
                LocTransferList[4].Value = DMA_IP_TRANSFER_SIZE_2_BYTE;    /* DMA_IP_CH_SET_DESTINATION_TRANSFER_SIZE: Write 2 bytes to internal buffer */
                LocTransferList[6].Value = 2U;                             /* DMA_IP_CH_SET_MINORLOOP_SIZE           : Transfer 2 bytes each minor loop (i.e. a Dma request) */
                LocTransferList[7].Value = Adc_Ipw_GetDspssThreadOutputBufferLength(PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET) >> 1U;  /* Major count = Number of samples (1 sample = 2 bytes) */
            }
            else
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */
            {
                /* Overwrite settings for other cases (e.g. ADCSAR and SDADC with DSPSS disabled) */
                LocTransferList[1].Value = DMA_IP_TRANSFER_SIZE_4_BYTE;  /* Read 4 bytes from hardware register */
                LocTransferList[4].Value = DMA_IP_TRANSFER_SIZE_4_BYTE;  /* Write 4 bytes to interrup buffer */
                LocTransferList[6].Value = 4U; /* DMA_IP_CH_SET_MINORLOOP_SIZE: Transfer 4 Bytes each minor loop (i.e. a Dma request) */
            }
        }
    }

#if ( (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) )
    /* Setup channel major linking */
    Adc_Ipw_SetupTcdSingleAdcChannelMajorLink(AdcIpwConfigPtr, GroupPtr, PhysicalHwUnitId);
#endif /* (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
    /* Setup last source address adjusment */
    Adc_Ipw_SetupTcdLastSourceAddressOffset(AdcIpwConfigPtr, GroupPtr);

#if ((STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS))
    /* Setup channel minor linking */
    Adc_Ipw_SetupTcdSingleAdcChannelMinorLink(AdcIpwConfigPtr, GroupPtr);
#endif /* (STD_ON == ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */
    Adc_Ipw_SetupTcdSingleAdcChannelDmaConfig(AdcDmaLogicChId, LocTransferList, LocTransferListNumElems);

