rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
}
static inline void Adc_Ipw_SetupTcdSingleAdcChannelDmaConfig(const uint32 AdcDmaLogicChId,
                                                             const Dma_Ip_LogicChannelTransferListType LocTransferList[],
                                                             const uint32 LocTransferListNumElems)
{
    /* Configure Dma transfer settings */
    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, LocTransferListNumElems);
    /* Enable Hardware Request for Dma */
    (void)Dma_Ip_SetLogicChannelCommand(AdcDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
}

static inline void Adc_Ipw_SetupTcdMultiAdcChannel(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                   const Adc_GroupConfigurationType * const GroupPtr,
                                                   Adc_ChannelIndexType ChannelCount)
{
    uint8 Index;
    uint8 PhysChannelId;
    uint8 LocTransferListNumElems;
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[15U];
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    const uint32 AdcCountingDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[LogicalHwUnitId];
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
    const Adc_GroupType Group = GroupPtr->GroupId;
    const Adc_StreamNumSampleType GroupNumSample = GroupPtr->NumSamples;
    const uint32 NumSgaElement = AdcIpwConfigPtr->Mapping.DmaNumSgaElement[LogicalHwUnitId];
    const Adc_Sar_Ip_ConfigType * AdcPtr = AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId];

    /* Prepare for Software TCD Configuration:
    0. Source Address (SADDR): Starting address of the first ADC channel
    1. Source Transfer Size (SSIZE): Number of bytes to read each time.
    2. Source Address Offset (SOFF): Each source read is completed,
        this value will be added to the current source address (Signed).
    3. Destination Address (DADDR): Address of Group Buffer.
    4. Destination Transfer Size (DSIZE): Number of bytes to write each time.
    5. Destination Address Offset (DOFF): Each destination write is completed,
        this value will be added to the current destination address (Signed).
    6. Minor Loop Size (NBYTES): number of bytes to transfer per service request.
    7. Major Loop Count (CITER): Number of minor loop in a major loop.
    8. Start to Transfer by Software (TCDn_CSR.START).
    9. Enable Major Interrupt (INTMAJOR): Enable Interrupt If Major count complete.
    10. Enable Half Major Interrupt (INTHALF): Enable Interrupt If Major Counter Half-complete
    11. Disable Automatic Hardware Request (DREQ): clear automatically the ERQ bit.
    Other fields upto type of the group:
    - The Destination Signed Last Address Adjustment (DLAST_SGA): The DADDR will be calculated automatically when a major done.
    - The Major Loop Enable Link (TCDn_BITER_ELINKYES.ELINK): Enable Linking Channel
    - The Major Loop Logic Channel Link (TCDn_BITER_ELINKYES.LINKCH): The DMA Channel Logic ID
    */
    for (Index = 0; Index < ChannelCount; Index++)
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        PhysChannelId = AdcPtr->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[Index]].ChanIndex;
#else
        PhysChannelId = AdcPtr->ChannelConfigsPtr[GroupPtr->AssignmentPtr[Index]].ChanIndex;
#endif
        LocTransferList[0].Param = DMA_IP_CH_SET_SOURCE_ADDRESS;
        LocTransferList[0].Value = Adc_Sar_Ip_GetDataAddress(PhysicalHwUnitId, PhysChannelId);
        LocTransferList[1].Param = DMA_IP_CH_SET_SOURCE_TRANSFER_SIZE;
        LocTransferList[1].Value = (uint32)1U; /* 2 Bytes */
        LocTransferList[2].Param = DMA_IP_CH_SET_SOURCE_SIGNED_OFFSET;
        LocTransferList[2].Value = (uint32)0U;
        LocTransferList[3].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
        /* Overwritten below if necessary */
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
        if (FALSE == GroupPtr->StreamResultGroupMultiSets)
        {
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
            LocTransferList[3].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Index * GroupNumSample]));
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
        }
        else
        {
            LocTransferList[3].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Index]));
        }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
        LocTransferList[4].Param = DMA_IP_CH_SET_DESTINATION_TRANSFER_SIZE;
        LocTransferList[4].Value = (uint32)1U; /* 2 Bytes */
        LocTransferList[5].Param = DMA_IP_CH_SET_DESTINATION_SIGNED_OFFSET;
        LocTransferList[5].Value = (uint32)0U;
        LocTransferList[6].Param = DMA_IP_CH_SET_MINORLOOP_SIZE;
        LocTransferList[6].Value = (uint32)2U;
        LocTransferList[7].Param = DMA_IP_CH_SET_MAJORLOOP_COUNT;
        LocTransferList[7].Value = (uint32)1U;
        LocTransferList[8].Param = DMA_IP_CH_SET_CONTROL_SOFTWARE_REQUEST;
        /* See below */
        LocTransferList[9].Param = DMA_IP_CH_SET_CONTROL_EN_MAJOR_INTERRUPT;
        /* See below */
        LocTransferList[10].Param = DMA_IP_CH_SET_CONTROL_EN_HALF_MAJOR_INTERRUPT;
        LocTransferList[10].Value = 0U; /* FALSE */
        LocTransferList[11].Param = DMA_IP_CH_SET_CONTROL_DIS_AUTO_REQUEST;
        LocTransferList[11].Value = 1U; /* TRUE */
        LocTransferListNumElems = 12U;
        /* If this is the first TCD configuration */
        if (0U == Index)
        {
            LocTransferList[8].Value = 0U; /* FALSE */
            LocTransferList[9].Value = 0U; /* FALSE */
        }
        /* If this is the last TCD configuration */
        else if (Index == (ChannelCount - 1U))
        {
            LocTransferList[8].Value = 1U; /* TRUE */
            LocTransferList[9].Value = 1U; /* TRUE */
        }
        else
        {
            LocTransferList[8].Value = 1U; /* TRUE */
            LocTransferList[9].Value = 0U; /* FALSE */
        }
        if ( \
                ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
            || (TRUE == GroupPtr->AdcOptimizeDmaStream)
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
           )
        {
            LocTransferList[1].Value = (uint32)2U; /* 4U Bytes because 2 is the ADC result register size and 2 are additional info Adc_Ipw_au32DmaNoIrqBuffer because needed for ReadGroup*/
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
            if (TRUE == GroupPtr->AdcOptimizeDmaStream)
            {
                LocTransferList[3].Value = (uint32)(&(Adc_Ipw_au32DmaIntermediateBuffer[PhysicalHwUnitId][Index])); /* Transfer results in internal buffer first */
            }
            else
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
            {
                LocTransferList[3].Value = (uint32)(&(Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][Index])); /* Transfer results in internal buffer first */
            }
            LocTransferList[4].Value = (uint32)2U; /* 4U Bytes because 2 is the ADC result register size and 2 are additional info Adc_Ipw_au32DmaNoIrqBuffer because needed for ReadGroup*/
            LocTransferList[6].Value = (uint32)4U; /* 4U Bytes because 2 is the ADC result register size and 2 are additional info Adc_Ipw_au32DmaNoIrqBuffer because needed for ReadGroup*/
            LocTransferList[9].Value = 0U; /* FALSE */
            LocTransferList[11].Value = 0U; /* FALSE */
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
            /* No other type of DMA STREAMING without interrupt supported */
            if ( \
                    ((GroupPtr->AccessMode == ADC_ACCESS_MODE_STREAMING) && ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt))
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
                || (TRUE == GroupPtr->AdcOptimizeDmaStream)
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
               )
            {
                /* For groups withoutInterrupt and streaming, all channel results for 1 sample are transferred using SG into an internal buffer.
                From this internal buffer, after each sample complete, transfer using linked AdcCountingDmaChanLogicId all samples into buffer registered via SetupResultBuffer. */
                if (Index == (ChannelCount - 1U))
                {
                    LocTransferList[12].Param = DMA_IP_CH_SET_MAJORLOOP_EN_LINK;
                    LocTransferList[12].Value = 1U; /* TRUE */
                    LocTransferList[13].Param = DMA_IP_CH_SET_MAJORLOOP_LOGIC_LINK_CH;
                    LocTransferList[13].Value = AdcCountingDmaLogicChId;
                }
                else
                {
                    LocTransferList[12].Param = DMA_IP_CH_SET_MAJORLOOP_EN_LINK;
                    LocTransferList[12].Value = 0U; /* FALSE */
                    LocTransferList[13].Param = DMA_IP_CH_SET_MAJORLOOP_LOGIC_LINK_CH;
                    LocTransferList[13].Value = 0U;
                }
                LocTransferListNumElems = 14U;
            }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
        }
        /* Write TCD Configuration for each channel */
        (void)Dma_Ip_SetLogicChannelScatterGatherList(AdcDmaLogicChId, Index, LocTransferList, LocTransferListNumElems);

        /* When number of element of Scatter Gather List is greater than number of channel of current group, the next TCD should not use */
        if ((Index == (ChannelCount - 1U)) && (Index < (NumSgaElement - 1U)))
        {
            LocTransferList[8].Value = 0U; /* FALSE */
            /* Disable start bit of the next tcd in case it was enabled earlier by a larger group.*/
            (void)Dma_Ip_SetLogicChannelScatterGatherList(AdcDmaLogicChId, ((uint32)Index + 1U), LocTransferList, LocTransferListNumElems);
        }
    }
    /* Write the first Software TCD to the Hardware. The next one will be loaded automaticaly by Scatter/Gather Programming */
    (void)Dma_Ip_SetLogicChannelScatterGatherConfig(AdcDmaLogicChId, 0U);
    /* Enable Hardware Request for Dma */
    (void)Dma_Ip_SetLogicChannelCommand(AdcDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
}

/**
* @brief        This function configures the DMA Transfer involved in the ADC conversion process.
* @details      This function configures the Dma Ip to Transfer data from Data Register to Result Buffer.
*               It should be called with the ADC Unit on standby (no ADC interrupt event allowed
*               because its code is not protected by critical regions) - no conversions is ongoing.
*
* @param[in]    Unit        The Adc Logical Unit Id.
* @param[in]    UserId   Current UserId
*
* @return       void
*
* @pre  ADC Unit is in stand by, there is no ongoing conversion.
*/
static inline void Adc_Ipw_StartDmaOperation(uint8 Unit,
                                             Adc_GroupType Group,
                                             uint8 UserId)
{
    uint8 Index;
    uint8 PhysChannelId;
    Adc_ChannelIndexType ChannelCount;
    const Adc_Ipw_Config * LocIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
    const Adc_HwUnitType PhysicalHwUnitId = LocIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group]; /* Group index in each partition */
    const uint32 AdcDmaLogicChId = LocIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
    const Adc_GroupConfigurationType * LocGroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]); /* Pointer to AdcGroup */
    const Adc_Sar_Ip_ConfigType * AdcPtr = LocIpwConfigPtr->AdcConfigPtrArr[Unit];
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    Dma_Ip_LogicChannelScatterGatherListType CountingDmaLocTransferList[16U];
    const uint32 AdcCountingDmaLogicChId = LocIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[Unit];
    Adc_StreamNumSampleType GroupNumSample = LocGroupPtr->NumSamples;
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */

