rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    /* Only needed for AdcSar units */
    if (PhysicalHwUnitId < ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* Clear DMA Request to make sure there is not any pending request */
        /* To clear pending request from ADC, need to force DMA Clear Source Mode to be Clearing of DMA Request on Acknowledgment from DMA Controller.
        Clear on Read means actually clear on read from ADC Data Register, and because the dummy transfer (Adc_Ipw_DmaClearPendingReq) does not read from ADC Data Register, the ADC request to DMA doesn't get cleared at all (unless configured as CLEAR ON ACK) */
        Adc_Sar_Ip_SetDmaClearSource(PhysicalHwUnitId, ADC_SAR_IP_DMA_REQ_CLEAR_ON_ACK);
        Adc_Ipw_DmaClearPendingReq(AdcDmaLogicChId);

        /* Back to previous configuration */
        Adc_Sar_Ip_SetDmaClearSource(PhysicalHwUnitId, AdcPtr->DmaClearSource);
    }

    /* Get number of channel in the Group */
#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
#else
    ChannelCount = LocGroupPtr->AssignedChannelCount;
#endif

    if ((uint8)STD_ON == LocGroupPtr->AdcWithoutInterrupt)
    {
        /* Reset Adc_Ipw_au32DmaNoIrqBuffer when enabling the group, because this buffer is used by ReadGroup to check that conversions are complete and results available */
        for (Index = 0; Index < ADC_MAX_CHANNEL_PER_HW_UNIT; Index++)
        {
            Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][Index] = ADC_IPW_INVALID_DATA_RESULT_DMA;
        }
    }

    /* For each channel in the list of ADC Channels in the Group, driver will configure the TCD in the Dma Ip driver.
    Depend on ChannelCount, driver uses Scatter/Gather Format (TCDn_CSR[ESG]=1, ChannelCount > 1) or Normal Format
    (TCDn_CSR[ESG]=0, ChannelCount=1). Associates one Software TCD for each Adc channel. Note that in Scatter/Gather,
    user have to configure number of elements be equivalent to ChannelCount, for more detail please see User Manual. */
    /* If there is more than one channel in the group */
    if (1U < ChannelCount)
    {
        Adc_Ipw_SetupTcdMultiAdcChannel(LocIpwConfigPtr, LocGroupPtr, ChannelCount);
    }
    /* If there is only one channel in the group, use normal TCD format instead of Scatter/Gather format */
    else
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        PhysChannelId = AdcPtr->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[0]].ChanIndex;
#else
        PhysChannelId = AdcPtr->ChannelConfigsPtr[LocGroupPtr->AssignmentPtr[0]].ChanIndex;
#endif
        Adc_Ipw_SetupTcdSingleAdcChannel(LocIpwConfigPtr, LocGroupPtr, PhysChannelId);
    }

#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    /* Configure Counting DMA channel to transfer results from Adc_Ipw_au32DmaNoIrqBuffer to buffer setup by user.
     Streaming results reorder feature must be enabled to allow running without interrupts for groups with ChannelCount > 1, and also ChannelCount == 1, but for the latter reorder is not necessary to be enabled at group level. */
    if ( \
            ((LocGroupPtr->AccessMode == ADC_ACCESS_MODE_STREAMING) && ((uint8)STD_ON == LocGroupPtr->AdcWithoutInterrupt))
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
         || ((TRUE == LocGroupPtr->AdcOptimizeDmaStream)
              &&
              (
                (ChannelCount > 1U)
#if (STD_ON == ADC_IPW_SDADC_IS_USED)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
                ||
                (
                  (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
                  &&
                  (NULL_PTR != LocIpwConfigPtr->SdadcConfigPtrArr[ LocGroupPtr->AdcLogicalUnitId ]->DspssConfig)
                )
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */
              )
            )
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
       )
    {
        /* Prepare for Software TCD Configuration:
        0. Source Address (SADDR): Address of Internal Buffer.
        1. Source Transfer Size (SSIZE): Number of bytes to read each time.
        2. Source Address Offset (SOFF): Each source read is completed,
            this value will be added to the current source address (Signed).
        3. Destination Address (DADDR): Address of Group Buffer.
        4. Destination Transfer Size (DSIZE): Number of bytes to write each time.
        5. Destination Address Offset (DOFF): Each destination write is completed,
            this value will be added to the current destination address (Signed).
        6. Minor Loop Size (NBYTES): number of bytes to transfer per service request.
        7. Major Loop Count (CITER): Number of minor loop in a major loop.
        8. Start to Transfer by Software (TCDn_CSR.START).
        9. Enable Major Interrupt (INTMAJOR): Enable Interrupt If Major count complete.
        10. Enable Half Major Interrupt (INTHALF): Enable Interrupt If Major Counter Half-complete
        11. Disable Automatic Hardware Request (DREQ): clear automatically the ERQ bit.
        Other fields upto type of the group:
        - The Destination Signed Last Address Adjustment (DLAST_SGA): The DADDR will be calculated automatically when a major done.
        - The Major Loop Enable Link (TCDn_BITER_ELINKYES.ELINK): Enable Linking Channel
        - The Major Loop Logic Channel Link (TCDn_BITER_ELINKYES.LINKCH): The DMA Channel Logic ID
        */
        if ((1U == ChannelCount) || ((ChannelCount > 1U) && (TRUE == LocGroupPtr->StreamResultGroupMultiSets)))
        {
            CountingDmaLocTransferList[0].Param = DMA_IP_CH_SET_SOURCE_ADDRESS;
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
            if (TRUE == LocGroupPtr->AdcOptimizeDmaStream)
            {
                CountingDmaLocTransferList[0].Value = (uint32)&(Adc_Ipw_au32DmaIntermediateBuffer[PhysicalHwUnitId][0U]);
            }
            else
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
            {
                CountingDmaLocTransferList[0].Value = (uint32)&(Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][0U]);
            }
            CountingDmaLocTransferList[1].Param = DMA_IP_CH_SET_SOURCE_TRANSFER_SIZE;
            CountingDmaLocTransferList[1].Value = (uint32)1U; /* 2 Bytes */
            CountingDmaLocTransferList[2].Param = DMA_IP_CH_SET_SOURCE_SIGNED_OFFSET;
            CountingDmaLocTransferList[2].Value = (uint32)4U; /* move by 4 Bytes, instead of 2 because they are store in Adc_Ipw_au32DmaNoIrqBuffer because needed for ReadGroup, but must not be in final result buffer */
            CountingDmaLocTransferList[3].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
            CountingDmaLocTransferList[3].Value = (uint32) & (Adc_axGroupStatus[Group].ResultsBufferPtr[0U]);
            CountingDmaLocTransferList[4].Param = DMA_IP_CH_SET_DESTINATION_TRANSFER_SIZE;
            CountingDmaLocTransferList[4].Value = (uint32)1U; /* 2 Bytes */
            CountingDmaLocTransferList[5].Param = DMA_IP_CH_SET_DESTINATION_SIGNED_OFFSET;
            CountingDmaLocTransferList[5].Value = (uint32)2U; /* 2U because this is ADC result register size. */
            CountingDmaLocTransferList[6].Param = DMA_IP_CH_SET_MINORLOOP_SIZE;
            CountingDmaLocTransferList[6].Value = (uint32)ChannelCount << 1UL; /* multiply by 2U because this is the ADC result data size */
            CountingDmaLocTransferList[7].Param = DMA_IP_CH_SET_MAJORLOOP_COUNT;
            CountingDmaLocTransferList[7].Value = (uint32)GroupNumSample;

            CountingDmaLocTransferList[8].Param = DMA_IP_CH_SET_MINORLOOP_EN_SRC_OFFSET;
            CountingDmaLocTransferList[8].Value = 1U; /* TRUE */
            CountingDmaLocTransferList[9].Param = DMA_IP_CH_SET_MINORLOOP_SIGNED_OFFSET;
            CountingDmaLocTransferList[9].Value = ADC_IPW_GET_COMPLEMENT_OF_2((uint32)ChannelCount << 2UL); /* multiply by 4U because 2 is the ADC result register size and 2 are additional info Adc_Ipw_au32DmaNoIrqBuffer because needed for ReadGroup*/

