rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
            CountingDmaLocTransferList[10].Param = DMA_IP_CH_SET_CONTROL_SOFTWARE_REQUEST;
            CountingDmaLocTransferList[10].Value = 0U; /* FALSE */
            CountingDmaLocTransferList[11].Param = DMA_IP_CH_SET_CONTROL_EN_MAJOR_INTERRUPT;
            CountingDmaLocTransferList[11].Value = 0U; /* FALSE */
            CountingDmaLocTransferList[12].Param = DMA_IP_CH_SET_CONTROL_EN_HALF_MAJOR_INTERRUPT;
            CountingDmaLocTransferList[12].Value = 0U; /* FALSE */
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
            if (TRUE == LocGroupPtr->AdcOptimizeDmaStream)
            {
                CountingDmaLocTransferList[11].Value = 1U; /* TRUE */
                CountingDmaLocTransferList[12].Value = LocGroupPtr->HalfInterrupt ? 1U : 0U;
            }
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
            CountingDmaLocTransferList[13].Param = DMA_IP_CH_SET_CONTROL_DIS_AUTO_REQUEST;
            CountingDmaLocTransferList[13].Value = 1U; /* TRUE */
            CountingDmaLocTransferList[14].Param = DMA_IP_CH_SET_SOURCE_SIGNED_LAST_ADDR_ADJ;
            CountingDmaLocTransferList[14].Value = ADC_IPW_GET_COMPLEMENT_OF_2((uint32)ChannelCount << 2UL); /* multiply by 4U because 2 is the ADC result register size and 2 are additional info Adc_Ipw_au32DmaNoIrqBuffer because needed for ReadGroup*/
            CountingDmaLocTransferList[15].Param = DMA_IP_CH_SET_DESTINATION_SIGNED_LAST_ADDR_ADJ;
            CountingDmaLocTransferList[15].Value = ADC_IPW_GET_COMPLEMENT_OF_2(((uint32)ChannelCount * (uint32)GroupNumSample) << 1U); /* multiply by 2U because this is the ADC result data size */

            (void)Dma_Ip_SetLogicChannelTransferList(AdcCountingDmaLogicChId, CountingDmaLocTransferList, 16U);
            /* Enable Hardware Request for Counting Dma channel */
            (void)Dma_Ip_SetLogicChannelCommand(AdcCountingDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
        }
    }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
}

#if (ADC_DEINIT_API == STD_ON)
static inline void Adc_Ipw_DmaClearHwRequest(uint8 UserId,
                                             Adc_HwUnitType LogicalHwUnitId)
{
    Adc_GroupType GroupIter = 0U;

    if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId])
    {
        for (GroupIter = 0U; GroupIter < (Adc_GroupType)Adc_apxCfgPtr[UserId]->GroupCount; GroupIter++)
        {
            if (((Adc_HwUnitType)LogicalHwUnitId == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIter].AdcLogicalUnitId) && \
                ((uint8)STD_OFF == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIter].AdcExtDMAChanEnable) \
               )
            {
                /* Disable DMA interrupt */
                (void)Dma_Ip_SetLogicChannelCommand(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId], DMA_IP_CH_CLEAR_HARDWARE_REQUEST);
            }
        }
    }
}
#endif /* (ADC_DEINIT_API == STD_ON) */

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
static inline void Adc_Ipw_EnableDMA(Adc_HwUnitType Unit,
                                     uint8 UserId,
                                     Adc_GroupType Group,
                                     const Adc_GroupConfigurationType * GroupPtr)
{
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Enable DMA for ADC module */
    Adc_Sar_Ip_DisableChannelDmaAll(PhysicalHwUnitId);
    Adc_Sar_Ip_EnableChannelDma(PhysicalHwUnitId,GroupPtr->LastCh);
    Adc_Sar_Ip_EnableDma(PhysicalHwUnitId);
    if((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
    {
        Adc_Ipw_StartDmaOperation(Unit, Group, UserId);
    }
}
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */

static inline void Adc_Ipw_StartNormalConversionAdcSarDmaEnable(const Adc_HwUnitType Unit,
                                                const uint8 UserId,
                                                const Adc_GroupType Group,
                                                const Adc_GroupConfigurationType * GroupPtr,
                                                const Adc_HwUnitType PhysicalHwUnitId)
{
    /* Disables DMA requests for all chanels */
    Adc_Sar_Ip_DisableChannelDmaAll(PhysicalHwUnitId);

    /* Enable DMA requests for ADC module */
    Adc_Sar_Ip_EnableChannelDma(PhysicalHwUnitId,GroupPtr->LastCh);
    /* Enable DMA for ADC module */
    Adc_Sar_Ip_EnableDma(PhysicalHwUnitId);

    if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
        {
            /* Configure DMA in MCL module */
            Adc_Ipw_StartDmaOperation(Unit, Group, UserId);
        }
}
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */
#endif /*ADC_DMA_SUPPORTED*/

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
* @brief          Initializes the Ncmr mask for group.
* @details        Initializes the Ncmr mask for group.
*
* @param[in]      CfgPtr       Pointer to configuration structure.
*
* @return         void
*
* @pre            Driver must be initialized.
*/
static inline void Adc_Ipw_InitNcmrMask(const Adc_ConfigType * CfgPtr)
{
    Adc_GroupType Group = 0U; /* Group Index */
    Adc_GroupType GroupIndex = 0U; /* Group Index */
    uint8 i;

    /* Initialize Group Status structures to beginning values */
    for (Group = 0U; Group < CfgPtr->GroupCount; Group++)  /* GroupCount = total number of groups */
    {
        GroupIndex = (Adc_GroupType)CfgPtr->GroupsPtr[Group].EnableChDisableChGroupIndex;
        if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupIndex)
        {
          for (i = 0u; i < ADC_IPW_NUM_OF_GROUP_CHN; i++)
          {
              Adc_axRuntimeChansEnMask[GroupIndex].ChanMaskArr[i] = CfgPtr->GroupsPtr[Group].AssignedChannelMask.ChanMaskArr[i];
          }
        }
    }
}
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */

#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
/**
* @brief          This function performs general configurations to the adc hardware prior to starting a conversion.
* @details        This function performs general configurations to the adc hardware prior to starting a conversion.
*
* @param[in]      Unit       The Adc Logical Unit Id.
* @param[in]      GroupPtr   The pointer to the group configuration structure.
* @param[in]      UserId     Current UserId
*
* @return         void
*/
static inline void Adc_Ipw_PrepareGroupStart(Adc_HwUnitType Unit,
                                             const Adc_GroupConfigurationType * GroupPtr,
                                             uint8 UserId)
{
#if (FEATURE_ADC_HAS_CONVERSION_TIMING || defined(ADC_AVERAGING_FUNCTIONALITY_SUPPORT))
#if FEATURE_ADC_HAS_CONVERSION_TIMING
    const Adc_ConversionTimeType * ConvTimePtr;
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
#endif /* (FEATURE_ADC_HAS_CONVERSION_TIMING || defined(ADC_AVERAGING_FUNCTIONALITY_SUPPORT)) */

