rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#ifdef ADC_AVERAGING_FUNCTIONALITY_SUPPORT
#if (ADC_DUAL_CLOCK_MODE == STD_ON)
if (ADC_NORMAL == Adc_aeClockMode[UserId])
    {
        if ((uint8)STD_ON == GroupPtr->AdcIpwGroupConfigPtr->GroupAvgEnable)
        {
            Adc_Sar_Ip_SetAveraging(PhysicalHwUnitId, TRUE, GroupPtr->AdcIpwGroupConfigPtr->GroupAvgSelect);
        }
    }
    else
    {
        if ((uint8)STD_ON == GroupPtr->AdcIpwGroupConfigPtr->GroupAvgEnableAlternate)
        {
            Adc_Sar_Ip_SetAveraging(PhysicalHwUnitId, TRUE, GroupPtr->AdcIpwGroupConfigPtr->GroupAvgSelectAlternate);
        }
    }
#else /* (ADC_DUAL_CLOCK_MODE == STD_OFF) */
    {
        if ((uint8)STD_ON == GroupPtr->AdcIpwGroupConfigPtr->GroupAvgEnable)
        {
            Adc_Sar_Ip_SetAveraging(PhysicalHwUnitId, TRUE, GroupPtr->AdcIpwGroupConfigPtr->GroupAvgSelect);
        }
    }
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */
#endif /* ADC_AVERAGING_FUNCTIONALITY_SUPPORT) */

#if FEATURE_ADC_HAS_CONVERSION_TIMING
    /* Get the configuration value of conversion time */
#if (ADC_DUAL_CLOCK_MODE == STD_ON)
    if (ADC_NORMAL == Adc_aeClockMode[UserId])
    {
        ConvTimePtr = GroupPtr->AdcIpwGroupConfigPtr->ConvTime;
    }
    else
    {
        ConvTimePtr = GroupPtr->AdcIpwGroupConfigPtr->AlternateConvTime;
    }
#else
    /* ADC_DUAL_CLOCK_MODE == STD_OFF */
    ConvTimePtr = GroupPtr->AdcIpwGroupConfigPtr->ConvTime;
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

    /*  Program Conversion Time */
    Adc_Sar_Ip_SetSampleTimes(PhysicalHwUnitId, ConvTimePtr);
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */

    (void)UserId;
}
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/**
* @brief    This function starts a normal conversion for AdcSar
*/
static void Adc_Ipw_StartNormalConversionAdcSar(const Adc_HwUnitType Unit,
                                                const uint8 UserId,
                                                const Adc_GroupType Group,
                                                const Adc_GroupConfigurationType * GroupPtr,
                                                const Adc_HwUnitType PhysicalHwUnitId)
{
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;

#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
    /* Configure group params (e.g. conversion time) if need before starting conversion */
    Adc_Ipw_PrepareGroupStart(Unit, GroupPtr, UserId);
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */
    Adc_Ipw_GetCmrRegister(Unit, Group, &CmrMask, UserId);
    /* Program the Normal Conversion Mask register */
    Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_NORMAL);
    Adc_Sar_Ip_SetConversionMode(PhysicalHwUnitId, (Adc_Sar_Ip_ConvModeType)GroupPtr->Mode);

    /* Clear Interrupt status flag */
    Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);

#ifdef ADC_DMA_SUPPORTED
    if ((ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit]) && (FALSE == GroupPtr->AdcWithoutDma))
    {
        /* Enable DMA for ADC module */
        Adc_Ipw_StartNormalConversionAdcSarDmaEnable(Unit, UserId, Group, GroupPtr, PhysicalHwUnitId);


    }
    else
#endif /* ADC_DMA_SUPPORTED */
    /* ADC_INTERRUPT */
    {
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED))
        /* If the group is configured for with interrupts */
        if ((uint8)STD_OFF == GroupPtr->AdcWithoutInterrupt)
        {
            /* Enable Interrupt */
            Adc_Sar_Ip_EnableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
        }
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */
    }

#if (ADC_SETCHANNEL_API == STD_ON)
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        /* Reset the update status */
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated = FALSE;
    }
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

    Adc_Sar_Ip_StartConversion(PhysicalHwUnitId, ADC_SAR_IP_CONV_CHAIN_NORMAL);
}

#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */


#if (ADC_IPW_SDADC_IS_USED == STD_ON)
#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
/**
* @brief    This function starts a normal conversion for SDADC
*/
static void Adc_Ipw_StartNormalConversionSdAdc(const Adc_HwUnitType Unit,
                                               const uint8 UserId,
                                               const Adc_GroupType Group,
                                               const Adc_GroupConfigurationType * GroupPtr,
                                               const Adc_HwUnitType PhysicalHwUnitId)
{
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
    /* SDADC units only support one channel per group */
    const Adc_ChannelType LogicChannelId = GroupPtr->AssignmentPtr[0];
    /* Get the physical channel */
    const Sdadc_Ip_ChannelType ChannelConfig = AdcIpwConfigPtr->SdadcConfigPtrArr[Unit]->ChannelConfigsPtr[LogicChannelId];

    /* Configure the input channel */
    Sdadc_Ip_SetInputChannel(PhysicalHwUnitId, ChannelConfig);

    Adc_Ipw_StartNormalConversionSdAdcClearFifo(PhysicalHwUnitId);

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    if ( (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit]) &&
         (FALSE   == GroupPtr->AdcWithoutDma)
       )
    {
        /* Enable DMA for SDADC module */
        Sdadc_Ip_EnableDmaEvents(PhysicalHwUnitId, SDADC_IP_EVENT_FIFO_FULL);

        if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
        {
            /* Configure DMA in MCL module */
            Adc_Ipw_StartDmaOperation(Unit, Group, UserId);
        }
    }
    else
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */
    /* ADC_INTERRUPT */
    {
#ifdef ADC_ANY_UNIT_FIFOFULL_ISR_USED
        /* If the group is configured for with interrupts */
        if ((uint8)STD_OFF == GroupPtr->AdcWithoutInterrupt)
        {
            /* Enable Interrupt */
            Sdadc_Ip_EnableInterruptEvents(PhysicalHwUnitId, SDADC_IP_EVENT_FIFO_FULL);
        }
#endif /* ADC_ANY_UNIT_FIFOFULL_ISR_USED */
    }

#if (ADC_HW_TRIGGER_API == STD_ON)
    if (ADC_TRIGG_SRC_HW == GroupPtr->TriggerSource)
    {
        /* Enable hardware trigger */
        Sdadc_Ip_EnableHwTrigger(PhysicalHwUnitId);
    }
    else
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    {
        /* Start conversion */
        Sdadc_Ip_ReloadConversion(PhysicalHwUnitId);
    }

