rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    /* Unused variable */
    (void)Group;
}

static inline void Adc_Ipw_StartNormalConversionSdAdcClearFifo(const Adc_HwUnitType PhysicalHwUnitId)
{
    /* Make sure there is no garbage in Fifo */
    Sdadc_Ip_FlushFifo(PhysicalHwUnitId);
    /* Clear all fifo status flags */
    Sdadc_Ip_ClearStatusFlags(PhysicalHwUnitId, SDADC_IP_FLAG_DATA_FIFO_FULL | SDADC_IP_FLAG_DATA_FIFO_OVERRUN);
}

/**
* @brief          This function stops the on-going conversion for SDADC
*/
static Std_ReturnType Adc_Ipw_StopCurrentConversionSdAdc(Adc_HwUnitType Unit,
                                                         Adc_GroupType Group,
                                                         uint8 UserId,
                                                         Adc_HwUnitType PhysicalHwUnitId)
{
#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    const Adc_GroupType                    GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * const GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);    /* Pointer to AdcGroup */
    const Adc_Ipw_Config      * const AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
#else
    /* Unused variable */
    (void)Unit;
    (void)Group;
    (void)UserId;
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */

    Std_ReturnType Status = (Std_ReturnType)E_OK;

    /* Stop the current conversion by temporarily disabling the SDADC */
    Sdadc_Ip_Powerdown(PhysicalHwUnitId);
    /* Disable fifo full request generation (for both interrupt and DMA) */
    Sdadc_Ip_DisableInterruptEvents(PhysicalHwUnitId, SDADC_IP_EVENT_FIFO_FULL);

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    if ( (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit]) &&
         (FALSE   == GroupPtr->AdcWithoutDma)
       )
    {
        if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
        {
            /* Disable DMA hardware request */
            (void)Dma_Ip_SetLogicChannelCommand(AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit], DMA_IP_CH_CLEAR_HARDWARE_REQUEST);
        }
    }
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */

    /* Re-enable the SDADC to be ready for the next conversion */
    Sdadc_Ip_Powerup(PhysicalHwUnitId);

    return Status;
}
#endif /* ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON)) */

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
static inline Std_ReturnType Adc_Ipw_ConfigureThresholdSdAdc(const Adc_ThresholdControlIndexType ThresholdControlIndex,
                                                             const Adc_ValueGroupType LowValue,
                                                             const Adc_ValueGroupType HighValue,
                                                             const uint8 UserId)
{
    Std_ReturnType Status                 = (Std_ReturnType)E_NOT_OK;
    const Adc_HwUnitType LogicalHwUnitId  = (uint8)(ThresholdControlIndex >> ADC_THRESHOLD_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16);
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId] - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
    const uint16 LogicalThresholdId       = ThresholdControlIndex & ADC_THRESHOLD_SYMBOLIC_NAME_MASK_THRESHOLD_ID_U16;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Std_ReturnType RangeValid                = (Std_ReturnType)E_NOT_OK;
    const Sdadc_Ip_ResolutionType Resolution = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->Resolution;

    if (SDADC_IP_RESOLUTION_15 == Resolution)
    {
        if ((uint16)LowValue <= (uint16)HighValue)
        {
            RangeValid = (Std_ReturnType)E_OK;
        }
    }
    else
    {
        if ((sint16)LowValue <= (sint16)HighValue)
        {
            RangeValid = (Std_ReturnType)E_OK;
        }
    }

    if ((Std_ReturnType)E_OK == RangeValid)
#endif
    {
        /* Check to avoid out of bound array index, and
        Check to avoid setting disabled threshold control
        */
        if ((LogicalThresholdId <= SDADC_IP_NUM_OF_THRESHOLD_REG) &&
            (TRUE == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->WdgEnable)
           )
        {
            /* Configure threshold values */
            Sdadc_Ip_SetWdgThreshold(PhysicalHwUnitId, HighValue, LowValue);
            /* Enable WDG interrupt events */
            Sdadc_Ip_EnableInterruptEvents(PhysicalHwUnitId, SDADC_IP_EVENT_WDOG_CROSSOVER);

            Status = (Std_ReturnType)E_OK;
        }
    }

    return Status;
}
#endif /* (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON) */

#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */


#if (ADC_HW_TRIGGER_API == STD_ON)

static inline Std_ReturnType Adc_Ipw_EnableHardwareTriggerAdcSar(const Adc_GroupType Group,
                                                                 const Adc_HwUnitType Unit,
                                                                 const uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr; /* Pointer to AdcGroup */
#if ( \
     ((defined(ADC_ANY_UNIT_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
     (defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) \
    )
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
    uint32  ImrSetVal = (uint32)0UL;
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) && ... */
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
    uint32  IsrSetVal = (uint32)0UL;
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;
    Adc_Sar_Ip_ExtTriggerEdgeType TriggerEdge = ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED;
    Adc_Sar_Ip_ExtTriggerSourceType TriggerSrc;
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
    Std_ReturnType ValidStatus = (Std_ReturnType)E_OK;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
    /* Configure group params (e.g. conversion time) if need before starting conversion */
    Adc_Ipw_PrepareGroupStart(Unit, GroupPtr, UserId);
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */

#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    if (ADC_CONV_TYPE_NORMAL == GroupPtr->Type)
    {
        Adc_Sar_Ip_SetConversionMode(PhysicalHwUnitId, ADC_SAR_IP_CONV_MODE_ONESHOT);
    }
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */

#if ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON))
    /* If the HW trigger source for the HW triggered group comes from BCTU/CTU */
    if (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
        /* Switch to CTU trigger mode */
        (void)Adc_Sar_Ip_SetCtuMode(PhysicalHwUnitId, ADC_SAR_IP_CTU_MODE_TRIGGER);
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
            /* Enable DMA for ADC module */
            Adc_Sar_Ip_DisableChannelDmaAll(PhysicalHwUnitId);
            Adc_Sar_Ip_EnableChannelDma(PhysicalHwUnitId, GroupPtr->LastCh);
            Adc_Sar_Ip_EnableDma(PhysicalHwUnitId);
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                /* Configure DMA in MCL module */
                Adc_Ipw_StartDmaOperation(Unit, Group, UserId);
            }
        }
#endif /* ADC_DMA_SUPPORTED */

