rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        /* Configure for BCTU trigger */
        ValidStatus = Adc_Ipw_BctuTriggerEnable(Group, GroupPtr->HwTriggerSource, TRUE, TRUE, UserId);
#endif /* ADC_IPW_BCTU_AVAILABLE == STD_ON */
    }
    else
#endif /* ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) */
    {
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
        /* Get configuration of normal conversion mask registers */
        Adc_Ipw_GetCmrRegister(Unit, Group, &CmrMask, UserId);
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
        /* Normal conversion */
        if (ADC_CONV_TYPE_NORMAL == GroupPtr->Type)
        {
            /* Program the Normal Conversion Mask register */
            Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_NORMAL);
            /* Clear Interrupt status flag */
            IsrSetVal |= ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN;
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED))
            ImrSetVal |= ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN;
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */

            /* Select the Edge */
            if (ADC_HW_TRIG_RISING_EDGE == GroupPtr->TriggerEdge)
            {
                TriggerEdge = ADC_SAR_IP_EXT_TRIG_EDGE_RISING;
            }
            else
            {
                TriggerEdge = ADC_SAR_IP_EXT_TRIG_EDGE_FALLING;
            }

#if FEATURE_ADC_HAS_AUX_EXT_TRIGGER
            if (GroupPtr->HwTriggerSource == (Adc_HwTriggerTimerType)ADC_IPW_EXT_TRG_SRC)
            {
#endif /* FEATURE_ADC_HAS_AUX_EXT_TRIGGER */
                TriggerSrc = ADC_SAR_IP_NORMAL_EXT_TRIG;
#if FEATURE_ADC_HAS_AUX_EXT_TRIGGER
            }
            else if (GroupPtr->HwTriggerSource == (Adc_HwTriggerTimerType)ADC_IPW_AUX_EXT_TRG_SRC)
            {
                TriggerSrc = ADC_SAR_IP_AUX_NORMAL_EXT_TRIG;
            }
            else /* normal and auxiliary are enabled simultaneously */
            {
                TriggerSrc = ADC_SAR_IP_ALL_NORMAL_EXT_TRIG;
            }
#endif /* FEATURE_ADC_HAS_AUX_EXT_TRIGGER */
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, TriggerEdge, TriggerSrc);
        }
        else
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
        {
            /* Program the Injected Conversion Mask register */
            Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_INJECTED);
            /* Clear Interrupt status flag and CTU interrupt flag */
            IsrSetVal |= ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_NOTIF_FLAG_CTU_EOC;
#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED))
            ImrSetVal |= ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN;
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) */

            /* Select the Edge */
            if (ADC_HW_TRIG_RISING_EDGE == GroupPtr->TriggerEdge)
            {
                TriggerEdge = ADC_SAR_IP_EXT_TRIG_EDGE_RISING;
            }
            else
            {
                TriggerEdge = ADC_SAR_IP_EXT_TRIG_EDGE_FALLING;
            }
            TriggerSrc = ADC_SAR_IP_INJECTED_EXT_TRIG;
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, TriggerEdge, TriggerSrc);
        }

#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
            /* Enable DMA for ADC module */
            Adc_Sar_Ip_DisableChannelDmaAll(PhysicalHwUnitId);
            Adc_Sar_Ip_EnableChannelDma(PhysicalHwUnitId,GroupPtr->LastCh);
            Adc_Sar_Ip_EnableDma(PhysicalHwUnitId);
            /* Configure DMA in MCL module */
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                /* Configure DMA in MCL module */
                Adc_Ipw_StartDmaOperation(Unit, Group, UserId);
            }
        }
        else
#endif /* ADC_DMA_SUPPORTED */
        {
#if ( \
     ((defined(ADC_ANY_UNIT_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
     (defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) \
    )
            if ((uint8)STD_OFF == GroupPtr->AdcWithoutInterrupt)
            {
                /* Enable Interrupt */
                Adc_Sar_Ip_EnableNotifications(PhysicalHwUnitId, ImrSetVal);
            }
            else
            {
                /* Disable Interrupt */
                Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ImrSetVal);
            }
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) && .. */
        }

        /* Clear Interrupt status flag */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, IsrSetVal);
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
    }

    return ValidStatus;
}


static inline void Adc_Ipw_DisableHardwareTriggerAdcSar(const Adc_GroupType Group,
                                                        const Adc_HwUnitType Unit,
                                                        const uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
#if ( \
     ((defined(ADC_ANY_UNIT_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
     (defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) \
    )
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
    uint32 ImrValue = (uint32)0UL;
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) && ... */
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
    uint32 IsrValue = (uint32)0UL;
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
    const Adc_GroupConfigurationType * GroupPtr; /* Pointer to AdcGroup */
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);

#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    /* Mapping PhysicalHwUnitId to CtuPhysicalId */
    uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];

    /* Set AdcIndex corresponding to bitfield in BCTU. eg: ADC0-2: BCTU0 and ADC3-6: BCTU1 */
    uint8 AdcIndexForCtu = PhysicalHwUnitId - Adc_Ipw_au8AdcIndexOffset[CtuPhysicalId];
#endif /* ADC_IPW_BCTU_AVAILABLE == STD_ON */

#if ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON))
    if (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        Bctu_Ip_DisableHwTrigger(CtuPhysicalId, (uint8)GroupPtr->HwTriggerSource);

