rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
        /* Clear interrupt flag status */
        Bctu_Ip_ClearStatusFlags(CtuPhysicalId,  (BCTU_IP_STATUS_ADC0_NDATA | BCTU_IP_STATUS_ADC0_DATAOVR | BCTU_IP_STATUS_ADC0_LAST) << AdcIndexForCtu);
#endif /* ADC_IPW_BCTU_AVAILABLE == STD_ON */

        /* Clear interrupt flags Interrupt Status */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_NOTIF_FLAG_CTU_EOC);

#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
            Adc_Ipw_DisableHardwareTriggerChannelDma(PhysicalHwUnitId, (uint32)GroupPtr->LastCh);

            if ((uint8)STD_ON == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[Unit])
            {
                if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
                {
                    /* Disable DMA interrupt */
                    (void)Dma_Ip_SetLogicChannelCommand(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit], DMA_IP_CH_CLEAR_HARDWARE_REQUEST);
                }
            }
        }
#endif /* ADC_DMA_SUPPORTED */
    }
    else
#endif /* ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) */
    {
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
            Adc_Ipw_DisableHardwareTriggerChannelDma(PhysicalHwUnitId, (uint32)GroupPtr->LastCh);

            if ((uint8)STD_ON == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[Unit])
            {
                if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
                {
                    /* Disable DMA interrupt */
                    (void)Dma_Ip_SetLogicChannelCommand(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit], DMA_IP_CH_CLEAR_HARDWARE_REQUEST);
                }
            }
        }
#endif /* ADC_DMA_SUPPORTED */

/* SWS_Adc_00116 */
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
        if (ADC_CONV_TYPE_NORMAL == GroupPtr->Type)
        {
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED))
            ImrValue = ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN;
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */
            IsrValue = ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN | ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC;

            /* Disable hardware trigger */
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_ALL_NORMAL_EXT_TRIG);
        }
        else
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
        {
#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED))
            ImrValue = ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN;
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) */
            IsrValue = ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC;

            /* Disable injected external trigger */
#if FEATURE_ADC_HAS_AUX_EXT_TRIGGER
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_ALL_NORMAL_EXT_TRIG);
#else
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_NORMAL_EXT_TRIG);
#endif /* FEATURE_ADC_HAS_AUX_EXT_TRIGGER */
        }

#if ( \
     ((defined(ADC_ANY_UNIT_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
     (defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) \
    )
        /* Disable Interrupt */
        Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ImrValue);
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) && ... */

        /* Clear interrupt flags Interrupt Status */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, IsrValue);
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
    }

    (void)GroupPtr;
}
#if (((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) || (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON))
#ifdef ADC_DMA_SUPPORTED

static inline void Adc_Ipw_DisableHardwareTriggerChannelDma(const Adc_HwUnitType PhysicalHwUnitId, uint32 Group)
{
    /* Disables DMA requests for ADC module */
    Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, Group);

    /* Disable DMA for ADC module */
    Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
}

#endif /* ADC_DMA_SUPPORTED */
#endif /* (((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) || (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON))*/
#if (ADC_IPW_SDADC_IS_USED == STD_ON)

static inline Std_ReturnType Adc_Ipw_EnableHardwareTriggerSdAdc(const Adc_GroupType Group,
                                                                const Adc_HwUnitType Unit,
                                                                const uint8 UserId)
{
    const Adc_GroupType                GroupIndex       = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr         = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    const Adc_HwUnitType               PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit] - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
    Std_ReturnType                     ValidStatus      = (Std_ReturnType)E_OK;
    const Sdadc_Ip_TriggerSelectType   TriggerSrc       = (Sdadc_Ip_TriggerSelectType)GroupPtr->HwTriggerSource;
    Sdadc_Ip_TriggerEdgeType           TriggerEdge;

    /* Select the Edge */
    if (ADC_HW_TRIG_RISING_EDGE == GroupPtr->TriggerEdge)
    {
        TriggerEdge = SDADC_IP_TRIGGER_RISING_EDGE;
    }
    else if (ADC_HW_TRIG_FALLING_EDGE == GroupPtr->TriggerEdge)
    {
        TriggerEdge = SDADC_IP_TRIGGER_FALLING_EDGE;
    }
    else
    {
        TriggerEdge = SDADC_IP_TRIGGER_BOTH_EDGE;
    }

    /* Configure hardware trigger */
    Sdadc_Ip_SetHwTrigger(PhysicalHwUnitId, TriggerEdge, TriggerSrc);

    /* Perform additional settings to be ready for hardware trigger event */
    Adc_Ipw_StartNormalConversionSdAdc(Unit, UserId, Group, GroupPtr, PhysicalHwUnitId);

