rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    return ValidStatus;
}


static inline void Adc_Ipw_DisableHardwareTriggerSdAdc(const Adc_GroupType Group,
                                                       const Adc_HwUnitType Unit,
                                                       const uint8 UserId)
{
    /* Get the SDADC physical hardware instance */
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit] - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;

    /* Disable HW trigger */
    Sdadc_Ip_DisableHwTrigger(PhysicalHwUnitId);

    /* Perform additional settings to completely stop the HW group */
    (void)Adc_Ipw_StopCurrentConversionSdAdc(Unit, Group, UserId, PhysicalHwUnitId);
}

#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */

#endif /* (ADC_HW_TRIGGER_API == STD_ON) */


#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
static inline  Std_ReturnType Adc_Ipw_ConfigureThresholdAdcSar(const Adc_ThresholdControlIndexType ThresholdControlIndex,
                                                               const Adc_ValueGroupType LowValue,
                                                               const Adc_ValueGroupType HighValue,
                                                               const uint8 UserId)
{
    Std_ReturnType Status = (Std_ReturnType)E_NOT_OK;
    uint16 LogicalThresholdId;
    uint8 CfgThresholdNum;
    Adc_Sar_Ip_WdgThresholdType WdgThreshold;

    const Adc_HwUnitType  LogicalHwUnitId = (uint8)(ThresholdControlIndex >> ADC_THRESHOLD_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16);
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    const Adc_WdgThresholdValueType MaxHighThreshold = ((Adc_WdgThresholdValueType)1U << ADC_SAR_IP_MAX_RESOLUTION) - 1U;
    const Adc_WdgThresholdValueType MaxLowThreshold  = ((Adc_WdgThresholdValueType)1U << ADC_SAR_IP_MAX_RESOLUTION) - 1U;

    if ((HighValue >= LowValue) && (HighValue <= MaxHighThreshold) && (LowValue <= MaxLowThreshold))
#endif /* if (ADC_DEV_ERROR_DETECT == STD_ON) */
    {
        LogicalThresholdId = ThresholdControlIndex & ADC_THRESHOLD_SYMBOLIC_NAME_MASK_THRESHOLD_ID_U16;
        CfgThresholdNum    = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->NumWdgThresholds;

        /* check to avoid out of bound array index */
        if (LogicalThresholdId <= CfgThresholdNum)
        {
            WdgThreshold.HighThresholdIntEn = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->WdgThresholds[LogicalThresholdId].HighThresholdIntEn;
            WdgThreshold.LowThresholdIntEn  = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->WdgThresholds[LogicalThresholdId].LowThresholdIntEn;

            /* Check to avoid setting disabled threshold control */
            if ((TRUE == WdgThreshold.HighThresholdIntEn) && (TRUE == WdgThreshold.LowThresholdIntEn))
            {
                WdgThreshold.LowThreshold  = LowValue;
                WdgThreshold.HighThreshold = HighValue;
                MCAL_DATA_SYNC_BARRIER();
                WdgThreshold.WdgIndex      = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->WdgThresholds[LogicalThresholdId].WdgIndex;
                MCAL_DATA_SYNC_BARRIER();
                Adc_Sar_Ip_SetWdgThreshold(PhysicalHwUnitId, WdgThreshold.WdgIndex, &WdgThreshold);

                Status = (Std_ReturnType)E_OK;
            }
        }
    }

    return Status;
}
#endif /* (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON) */


/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
/**
* @brief          This function performs the mapping of Bctu (Ctu) Physical ID to corresponding ADC instance.
* @details        This function performs the mapping of Bctu (Ctu) Physical ID to corresponding ADC instance.
*
* @param[in]      AdcPhysicalId   Adc HW instance used. 
*
* @return         uint8
*/
uint8 Adc_Ipw_AdcPhysicalToCtuPhysical(Adc_HwUnitType AdcPhysicalId)
{
    /* Mapping CTU HW instance to corresponding ADC HW instance */
    return Adc_Ipw_au8AdcIdToCtuId[AdcPhysicalId];
}
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

#if ((ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_SETCHANNEL_API == STD_ON))
void Adc_Ipw_SetChansMask(Adc_ChansIdxMaskType * const ChansMask,
                          const uint32 ChanIdx)
{
    uint32 GroupIdx = ChanIdx / 32U;
    uint32 Shift = ChanIdx % 32U;

    if (GroupIdx < ADC_IPW_NUM_OF_GROUP_CHN)
    {
        ChansMask->ChanMaskArr[GroupIdx] |= ((uint32)1U << Shift);
    }

    #if (ADC_IPW_NUM_OF_GROUP_CHN > 3U)
        #error "Adc Ipw ADC_IPW_NUM_OF_GROUP_CHN out of range."
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 3U) */
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON || ADC_SETCHANNEL_API == STD_ON */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
void Adc_Ipw_ClearChansMask(Adc_ChansIdxMaskType * const ChansMask,
                            const uint32 ChanIdx)
{
    uint32 GroupIdx = ChanIdx / 32U;
    uint32 Shift = ChanIdx % 32U;

    if (GroupIdx < ADC_IPW_NUM_OF_GROUP_CHN)
    {
        ChansMask->ChanMaskArr[GroupIdx] &= ~((uint32)1U << Shift);
    }

    #if (ADC_IPW_NUM_OF_GROUP_CHN > 3U)
        #error "Adc Ipw ADC_IPW_NUM_OF_GROUP_CHN out of range."
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 3U) */
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

/**
* @brief          This function clears VALID bit from ADC Conversion Data Registers
* @details        This function clears VALID bit from ADC Conversion Data Registers
*
* @param[in]      Unit          The ADC hardware unit
* @param[in]      Group         The group to be converted
* @param[in]      UserId        Current UserId
*
* @return         void
*
*/
void Adc_Ipw_ClearValidBit(Adc_HwUnitType Unit,
                           Adc_GroupType Group,
                           uint8 UserId)
{
    Adc_ChannelIndexType ChTemp;
    Adc_ChannelType ChIndexTemp;
    Adc_ChannelIndexType ChannelCount;
#if (ADC_SETCHANNEL_API == STD_OFF)
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
#endif /*ADC_SETCHANNEL_API == STD_OFF*/
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
#else
    ChannelCount = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AssignedChannelCount;
#endif

    /* Clear VALID bit from ADC result registers for all channels assigned to the group when conversion is aborted */
    for (ChTemp = 0U; ChTemp < ChannelCount; ChTemp++)
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        ChIndexTemp = Adc_axRuntimeGroupChannel[Group].ChannelPtr[ChTemp];
#else
        ChIndexTemp = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AssignmentPtr[ChTemp];
#endif
        (void) Adc_Sar_Ip_GetConvData(PhysicalHwUnitId, (uint32)Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit]->ChannelConfigsPtr[ChIndexTemp].ChanIndex);
    }
}

/**
* @brief          This function initializes the ADC hardware modules, triggering units and the ADC driver.
* @details        This function initializes the ADC hardware module, and the ADC driver.
*
* @param[in]      IpwCfg           Configuration data pointer.
* @param[in]      UserId           Current UserId
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              If Power up/Power down activities return status as expected.
* @retval         E_NOT_OK          If Power up/Power down activities couldn't return status as expected.
*
*/
Std_ReturnType Adc_Ipw_Init(const Adc_Ipw_Config * IpwCfg,
                            const uint8 UserId)
{
    Adc_HwUnitType LogicalHwUnitId = 0U;
    Adc_HwUnitType PhysicalHwUnitId = 0U;
    Std_ReturnType TimeOutStatus = (Std_ReturnType)E_OK;

