rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#if ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON) && (ADC_HW_TRIGGER_API == STD_ON))
    uint8 CtuPhysicalId = 0U;
    uint8 CheckCallBctu = 0U;
#endif

    /* Initialize Unit Status structures */
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    Adc_Ipw_InitNcmrMask(Adc_apxCfgPtr[UserId]);
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */

    for (LogicalHwUnitId = 0U; LogicalHwUnitId < ADC_IPW_MAX_HW_UNITS; LogicalHwUnitId++)
    {
        if (IpwCfg->Mapping.AdcHwUnitArr[LogicalHwUnitId] == (uint8)STD_ON) /* Hardware Unit is enabled on current partition */
        {
            PhysicalHwUnitId = IpwCfg->AdcPhysicalIdArr[LogicalHwUnitId];

            /* 1) Init ADC hardware */
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
            if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
            {
                /* SDADC */
                if (SDADC_IP_STATUS_SUCCESS != Sdadc_Ip_Init((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET, IpwCfg->SdadcConfigPtrArr[LogicalHwUnitId]))
                {
                    TimeOutStatus = E_NOT_OK;
                }
            }
            else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
            {
                /* ADCSAR */
                if (ADC_SAR_IP_STATUS_SUCCESS != Adc_Sar_Ip_Init(PhysicalHwUnitId, IpwCfg->AdcConfigPtrArr[LogicalHwUnitId]))
                {
                    TimeOutStatus = E_NOT_OK;
                }
            }

            /* 2) Init BCTU hardware */
#if ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && (ADC_IPW_BCTU_AVAILABLE == STD_ON) && (ADC_HW_TRIGGER_API == STD_ON))
            /* Mapping PhysicalHwUnitId to CtuPhysicalId */
            CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];
            if ( (CtuPhysicalId != ADC_IPW_INVALID_PHYSICAL_UNIT_ID) && (IpwCfg->CtuConfigTriggerMode[CtuPhysicalId] != NULL_PTR) )
            {
                /* Check if the Bctu instance is already called */
                if (0U == (CheckCallBctu & (1U << CtuPhysicalId)))
                {
                    Bctu_Ip_Init(CtuPhysicalId, IpwCfg->CtuConfigTriggerMode[CtuPhysicalId]);
                    CheckCallBctu |= (1U << CtuPhysicalId);
                }
            }
#endif /* (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) &&... */

            if (TimeOutStatus != (Std_ReturnType)E_OK)
            {
                break;
            }
        }
    }

    (void)UserId;

    return TimeOutStatus;
}

#if (ADC_DEINIT_API == STD_ON)
/**
* @brief          This function de-initializes the ADC driver, and the ADC hardware.
* @details        This function de-initializes the ADC driver, and ensures that the ADC hardware
*                 will be in the power on after reset state.
*
* @param[in]      UserId         Current UserId
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              If the operation completed successfully.
* @retval         E_NOT_OK          In case of timeout while waiting for adc hardware operations.
*
*/
Std_ReturnType Adc_Ipw_DeInit(uint8 UserId)
{
    Adc_HwUnitType LogicalHwUnitId = 0U;
    Adc_HwUnitType PhysicalHwUnitId = 0U;
    Adc_GroupType GroupId = 0U;
    Adc_GroupType GroupIter = 0U;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    Adc_GroupType GroupIndex = 0U;
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    Std_ReturnType ReturnStatus = E_OK;

#if ((ADC_HW_TRIGGER_API == STD_ON) || (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON))
    uint8 CtuPhysicalId;
    boolean CtuOnGoing;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) || (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

    for (LogicalHwUnitId = 0U; LogicalHwUnitId < ADC_IPW_MAX_HW_UNITS; LogicalHwUnitId++)
    {
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[LogicalHwUnitId] == (uint8)STD_ON) /* HW unit enabled on current partition */
        {
            PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];

#if ((ADC_HW_TRIGGER_API == STD_ON) || (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON))
            /* Mapping AdcPhysicalID to CtuPhysicalID */
            CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];
            if (CtuPhysicalId != ADC_IPW_INVALID_PHYSICAL_UNIT_ID)
            {
                /* Set default as NOT on-going */
                CtuOnGoing = FALSE;

                /* Check CTU trigger mode configuration pointer */
                if (NULL_PTR != Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigTriggerMode[CtuPhysicalId])
                {
                    CtuOnGoing = TRUE;
                }

                /* 1) De-init BCTU hardware */
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
                /* Check CTU control mode status variable */
                if (TRUE == Adc_axUnitStatus[LogicalHwUnitId].CtuControlOngoing)
                {
                    CtuOnGoing = TRUE;
                    /* Mark the unit as CTU control mode is not ongoing */
                    Adc_axUnitStatus[LogicalHwUnitId].CtuControlOngoing = FALSE;
                }
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
                /* Deinit Bctu */
                if (TRUE == CtuOnGoing)
                {
                    /* De-init CTU hardware */
                    (void)Bctu_Ip_Deinit((uint32)CtuPhysicalId);
                }
            }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) || (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

            /* 2) De-init ADC hardware */
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
            if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
            {
                /* SDADC */
                Sdadc_Ip_Deinit((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET);
            }
            else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
            {
                if (ADC_SAR_IP_STATUS_SUCCESS != Adc_Sar_Ip_Deinit(PhysicalHwUnitId))
                {
                    ReturnStatus = E_NOT_OK;
                }
            }

