rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
            /* 3) Disable DMA hardware */
#ifdef ADC_DMA_SUPPORTED
            Adc_Ipw_DmaClearHwRequest(UserId, LogicalHwUnitId);
#endif /* ifdef ADC_DMA_SUPPORTED */

            if ((Std_ReturnType)E_OK != ReturnStatus)
            {
                break;
            }
        }
    }

    for (GroupIter = 0U; GroupIter < (Adc_GroupType)Adc_apxCfgPtr[UserId]->GroupCount; GroupIter++)
    {
        GroupId = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIter].GroupId;
#if (ADC_SETCHANNEL_API == STD_ON)
        Adc_axRuntimeGroupChannel[GroupId].ChannelPtr = NULL_PTR;
        Adc_axRuntimeGroupChannel[GroupId].ChannelCount = 0U;
        Adc_axRuntimeGroupChannel[GroupId].RuntimeUpdated = FALSE;
#endif
        Adc_axGroupStatus[GroupId].ResultsBufferPtr = NULL_PTR;
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        Adc_axGroupStatus[GroupId].Notification = ADC_NOTIFICATION_DISABLED;
#endif  /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        /* Disable all normal conversion mask */
        GroupIndex = (Adc_GroupType)Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIter].EnableChDisableChGroupIndex;
        if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupIndex)
        {
            Adc_axRuntimeChansEnMask[GroupIndex].ChanMaskArr[0u] = (uint32)0u;
        #if (ADC_SAR_IP_NUM_GROUP_CHAN > 1u)
            Adc_axRuntimeChansEnMask[GroupIndex].ChanMaskArr[1u] = (uint32)0u;
        #endif /* (ADC_SAR_IP_NUM_GROUP_CHAN > 1u) */
        #if (ADC_SAR_IP_NUM_GROUP_CHAN > 2u)
            Adc_axRuntimeChansEnMask[GroupIndex].ChanMaskArr[2u] = (uint32)0u;
        #endif /* (ADC_SAR_IP_NUM_GROUP_CHAN > 2u) */
        }
#endif  /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    }
#if (ADC_DUAL_CLOCK_MODE == STD_ON)
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
    Adc_aeClockMode[UserId] = ADC_NORMAL;
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

    return ReturnStatus;
}
#endif /* (ADC_DEINIT_API == STD_ON) */

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/**
* @brief          This function starts the conversion on the specified hardware Unit.
* @details        This function starts the conversion on the specified hardware Unit.
*                 This function should be called with the ADC Unit on standby (no ADC interruptions
*                 allowed because its code is not protected by critical regions) - no conversions must
*                 be running.
*
* @param[in]      Unit            the used hw Unit.
* @param[in]      UserId          Current UserId
*
* @return         void
*
*/
void Adc_Ipw_StartNormalConversion(Adc_HwUnitType Unit,
                                   uint8 UserId)
{
    const Adc_GroupConfigurationType * GroupPtr; /* Pointer to AdcGroup */
    Adc_GroupType Group = 0U; /* Active group in the Queue */
    Adc_GroupType GroupIndex = 0U; /* Group index in each partition */
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Do nothing if there is no request available in queue */
    if ((Adc_QueueIndexType)0 != Adc_axUnitStatus[Unit].SwNormalQueueIndex)
    {
        /* Get the Group ID of the current active group */
        /* Load the first group in the queue (Adc_axUnitStatus[Unit].SwNormalQueue[0])*/
        Group = Adc_axUnitStatus[Unit].SwNormalQueue[0];
        GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
        GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        if (!((TRUE == Adc_axGroupStatus[Group].LimitCheckFailed) && (ADC_SAR_IP_CONV_MODE_ONESHOT == (Adc_Sar_Ip_ConvModeType) GroupPtr->Mode)))
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
        {

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
            if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
            {
                /* SDADC */
                PhysicalHwUnitId -= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
                Adc_Ipw_StartNormalConversionSdAdc(Unit, UserId, Group, GroupPtr, PhysicalHwUnitId);
            }
            else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
            {
                /* ADCSAR */
                Adc_Ipw_StartNormalConversionAdcSar(Unit, UserId, Group, GroupPtr, PhysicalHwUnitId);
            }

        }
    }
}

#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
/**
* @brief          This function starts the injected conversion on the specified hardware Unit.
* @details        This function starts the injected conversion on the specified hardware Unit.
*                 This function should be called with the ADC Unit on idle or busy.
*
* @param[in]      Unit            The used hw Unit.
* @param[in]      UserId          Current UserId
*
* @return         void
*/
void Adc_Ipw_StartInjectedConversion(Adc_HwUnitType Unit,
                                     uint8 UserId)
{
    Adc_GroupType Group = 0U; /* Active group in the Queue */
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) || defined(ADC_DMA_SUPPORTED))
    Adc_GroupType GroupIndex = 0U;
    const Adc_GroupConfigurationType * GroupPtr; /* Pointer to AdcGroup */
#endif

    /* Do nothing if there is no request available in queue */
    if ((Adc_QueueIndexType)0 != Adc_axUnitStatus[Unit].SwInjectedQueueIndex)
    {
        /* Get the Group ID of the current active group */
        /* Load the first group in the queue (Adc_axUnitStatus[Unit].SwInjectedQueue[0])*/
        Group = Adc_axUnitStatus[Unit].SwInjectedQueue[0];
#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) || defined(ADC_DMA_SUPPORTED))
        GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
        GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
#endif
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
        /* Configure group params (e.g. conversion time) if need before starting conversion */
        Adc_Ipw_PrepareGroupStart(Unit, GroupPtr, UserId);
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */

        /* Get mask of channels using injected conversion */
        Adc_Ipw_GetCmrRegister(Unit, Group, &CmrMask, UserId);

        /* Program the Injected Conversion Mask register */
        Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_INJECTED);

