rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
        /* Clear Interrupt status flag */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);

#ifdef ADC_DMA_SUPPORTED
        if ((ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit]) && (FALSE == GroupPtr->AdcWithoutDma))
        {
            /* Enable DMA for ADC module */
            Adc_Ipw_EnableDMA(Unit, UserId, Group, GroupPtr);
        }
        else
#endif /* ADC_DMA_SUPPORTED */
        {
#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED))
            /* If the group is configured for with interrupts */
            if ((uint8)STD_OFF == GroupPtr->AdcWithoutInterrupt)
            {
                /* If the group is configured for with interrupts */
                /* Enable Injected Interrupt */
                Adc_Sar_Ip_EnableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);
            }
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) */
        }

#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED))
        if ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt)
        {
            /* Disable Injected Interrupt */
            Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);
        }
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) */

#if (ADC_SETCHANNEL_API == STD_ON)
        if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
        {
            /* Reset the update status */
            Adc_axRuntimeGroupChannel[Group].RuntimeUpdated =  FALSE;
        }
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

        /* Start Injected Conversion */
        Adc_Sar_Ip_StartConversion(PhysicalHwUnitId, ADC_SAR_IP_CONV_CHAIN_INJECTED);
    }
}
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */


static Std_ReturnType Adc_Ipw_StopCurrentConversionAdcSar(Adc_HwUnitType Unit,
                                                          Adc_GroupType Group,
                                                          uint8 UserId,
                                                          Adc_HwUnitType PhysicalHwUnitId)
{
#if ((ADC_BYPASS_ABORT_CHAIN_CHECK == STD_ON) || defined(ADC_DMA_SUPPORTED))
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
#endif /* (ADC_BYPASS_ABORT_CHAIN_CHECK == STD_ON) || defined(ADC_DMA_SUPPORTED) */
    Std_ReturnType Status = (Std_ReturnType)E_OK;
    Adc_Sar_Ip_StatusType AdcSarStatus = ADC_SAR_IP_STATUS_SUCCESS;

#ifdef ADC_DMA_SUPPORTED
    if ((ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit]) && (FALSE == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcWithoutDma))
    {
        /* Disable all DMA mask register */
#if ((ADC_BYPASS_ABORT_CHAIN_CHECK == STD_ON) || (ADC_SETCHANNEL_API == STD_OFF))
        Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].LastCh);
#endif /* (ADC_BYPASS_ABORT_CHAIN_CHECK == STD_ON) || (ADC_SETCHANNEL_API == STD_OFF) */
        Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
        if ((uint8)STD_ON == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[Unit])
        {
            if ((uint8)STD_OFF == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcExtDMAChanEnable)
            {
                /* Disable DMA hardware request */
                (void)Dma_Ip_SetLogicChannelCommand(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit], DMA_IP_CH_CLEAR_HARDWARE_REQUEST);
            }
        }
    }
    else
#endif /* ADC_DMA_SUPPORTED */
    {
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED))
        Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */
    }

    /*  Stop the conversion and abort the current group conversion */
#if (ADC_BYPASS_ABORT_CHAIN_CHECK == STD_ON)
    if ((uint8)STD_ON == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcWithoutInterrupt)
    {
        AdcSarStatus = Adc_Sar_Ip_AbortChain(PhysicalHwUnitId, FALSE, FALSE);
    }
    else
    {
        /* Check timeout after aborting current conversion */
        AdcSarStatus = Adc_Sar_Ip_AbortChain(PhysicalHwUnitId, TRUE, FALSE);
    }
#else
    AdcSarStatus = Adc_Sar_Ip_AbortChain(PhysicalHwUnitId, TRUE, FALSE);
#endif /* (ADC_BYPASS_ABORT_CHAIN_CHECK == STD_ON) */

    /* Clear interrupt status after hardware disabled */
    Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);

    if (ADC_SAR_IP_STATUS_SUCCESS != AdcSarStatus)
    {
        Status = E_NOT_OK;
    }
    else
    {
        /* Clear VALID bit from ADC Data Registers for all channels assigned to the group when conversion is aborted */
        Adc_Ipw_ClearValidBit(Unit, Group, UserId);
    }

    return Status;
}

/**
* @brief          This function stops the current conversion of a group.
* @details        This function stops the current conversion of a group.
*
* @param[in]      Unit      The hardware Unit.
* @param[in]      Group     The group id.
* @param[in]      UserId    Current UserId
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            If the conversion has stopped as expected.
* @retval         E_NOT_OK        In case of timeout while waiting for adc hardware to stop a conversion.
*
*/
Std_ReturnType Adc_Ipw_StopCurrentConversion(Adc_HwUnitType Unit,
                                             Adc_GroupType Group,
                                             uint8 UserId)
{
    Std_ReturnType Status;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        PhysicalHwUnitId -= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
        Status = Adc_Ipw_StopCurrentConversionSdAdc(Unit, Group, UserId, PhysicalHwUnitId);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        Status = Adc_Ipw_StopCurrentConversionAdcSar(Unit, Group, UserId, PhysicalHwUnitId);
    }

