rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    return Status;
}
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#if (ADC_HW_TRIGGER_API == STD_ON)
/**
* @brief          This function enables the hardware triggers for the specified group.
* @details        This function enables the hardware triggers for the specified group.
*
* @param[in]      Group           The group for which the hardware triggers will be enabled.
* @param[in]      Unit            The hardware Unit. (on other platforms there are more hw units)
* @param[in]      UserId          Current UserId
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              If there is no running conversion.
* @retval         E_NOT_OK          If there is a running conversion.
*
*/
Std_ReturnType Adc_Ipw_EnableHardwareTrigger(Adc_GroupType Group,
                                             Adc_HwUnitType Unit,
                                             uint8 UserId)
{
    Std_ReturnType ValidStatus = (Std_ReturnType)E_OK;

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        ValidStatus = Adc_Ipw_EnableHardwareTriggerSdAdc(Group, Unit, UserId);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        ValidStatus = Adc_Ipw_EnableHardwareTriggerAdcSar(Group, Unit, UserId);
    }

#if (ADC_SETCHANNEL_API == STD_ON)
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        /* Roll back to the first sample */
        Adc_axGroupStatus[Group].ResultIndex = 0U;
        /* Reset the update status */
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated =  FALSE;
    }
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

    return ValidStatus;
}

/**
* @brief          This function disables the hardware triggers for the specified group.
* @details        This function disables the hardware triggers for the specified group.
*
* @param[in]      Group           The group for which the hardware triggers will be enabled.
* @param[in]      Unit            The hardware Unit. (on other platforms there are more hw units)
*
* @return         void
*
*/
void Adc_Ipw_DisableHardwareTrigger(Adc_GroupType Group,
                                    Adc_HwUnitType Unit,
                                    uint8 UserId)
{
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        Adc_Ipw_DisableHardwareTriggerSdAdc(Group, Unit, UserId);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        Adc_Ipw_DisableHardwareTriggerAdcSar(Group, Unit, UserId);
    }
}

#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
/**
* @brief          This function gets channel list.
* @details        This local function to get the channel list used with CTU Triggered Mode.
*                   Finding the position of largest physical channel id and swap with last channel of list in case of DMA is used
*
* @param[out]     ChanList           List of channels.
* @param[in]      ChannelCount       The size of channel list
* @param[in]      Group              Group index
* @param[in]      LogicalHwUnitId    Adc logical id
* @param[in]      UserId             Current user id
*
* @return         void
*
*/
void Adc_Ipw_GetCtuChanList(uint8 * ChanList,
                            uint8 ChannelCount,
                            Adc_GroupType Group,
                            Adc_HwUnitType LogicalHwUnitId,
                            uint8 UserId)
{
    uint8 Index;
#ifdef ADC_DMA_SUPPORTED
    uint8 LastChIndex = 0U;
    uint8 LastChTemp;
#endif /* ADC_DMA_SUPPORTED */
#if ((ADC_SETCHANNEL_API == STD_OFF) || defined(ADC_DMA_SUPPORTED))
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
#endif /* (ADC_SETCHANNEL_API == STD_OFF) || defined(ADC_DMA_SUPPORTED) */
    const Adc_Ipw_Config * LocIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;

    for (Index = 0U; Index < ChannelCount; Index++)
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        ChanList[Index] = LocIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[Index]].ChanIndex;
#else
        ChanList[Index] = LocIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->ChannelConfigsPtr[(GroupPtr->AssignmentPtr[Index])].ChanIndex;
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

#ifdef ADC_DMA_SUPPORTED
        if ((ADC_DMA == LocIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) && (ChanList[Index] == GroupPtr->LastCh))
        {
            /* Save position of largest physical channel id */
            LastChIndex = Index;
        }
#endif /* ADC_DMA_SUPPORTED */
    }

#ifdef ADC_DMA_SUPPORTED
    /* Place largest physical channel id to end of list */
    if ((ADC_DMA == LocIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) && (LastChIndex != (ChannelCount - 1U)))
    {
        LastChTemp = ChanList[LastChIndex];
        ChanList[LastChIndex] = ChanList[(ChannelCount - 1U)];
        ChanList[(ChannelCount - 1U)] = LastChTemp;
    }
#endif /* ADC_DMA_SUPPORTED */
}

/**
* @brief          This function enables the hardware trigger for the specified group.
* @details        Autosar Extension API to enable the trigger source configured for the group.
*
* @param[in]      Group           The group for which the hardware triggers will be enabled.
* @param[in]      TriggerSource   Trigger source to be use for the group
* @param[in]      AutosarApi      Indicates whether function is called from ASR function or non-ASR function
* @param[in]      FirstTrigger    Indicates whether trigger source is the first trigger source is enabled
* @param[in]      UserId          UserId
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              If there is no running conversion.
* @retval         E_NOT_OK          If there is a running conversion.
*
*/
static inline Std_ReturnType Adc_Ipw_BctuTriggerEnable(const Adc_GroupType Group,
                                                       Adc_HwTriggerTimerType TriggerSource,
                                                       boolean AutosarApi,
                                                       boolean FirstTrigger,
                                                       uint8 UserId)
{
#if (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF)
    uint8 Index;
    Adc_ChannelIndexType ChannelCount;
    uint8 ChanList[ADC_MAX_CHANNEL_PER_HW_UNIT];
#endif /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF) */
    Bctu_Ip_TrigConfigType TrigConfig;
    const Adc_ConfigType * CfgPtr = Adc_apxCfgPtr[UserId];
    const Adc_GroupType GroupIndex = CfgPtr->GroupIdToIndexMapPtr[Group];
    const Adc_HwUnitType LogicalHwUnitId = CfgPtr->GroupsPtr[GroupIndex].AdcLogicalUnitId;
    const Adc_HwUnitType PhysicalHwUnitId = CfgPtr->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    /* Mapping PhysicalHwUnitId to CtuPhysicalId */
    uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];

    /* Set AdcIndex corresponding to bitfield in BCTU. eg: ADC0-2: BCTU0 and ADC3-6: BCTU1 */
    uint8 AdcIndexForCtu = PhysicalHwUnitId - Adc_Ipw_au8AdcIndexOffset[CtuPhysicalId];

    const Adc_GroupConfigurationType * GroupPtr = &(CfgPtr->GroupsPtr[GroupIndex]);
    Bctu_Ip_StatusType BctuStatus;
    const uint8 BctuNotifAdcUnitFlag = (uint8)(BCTU_IP_NOTIF_ADC0 << AdcIndexForCtu);
    Std_ReturnType ReturnStatus = (Std_ReturnType)E_OK;

