rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    Bctu_Ip_SetGlobalTriggerEn(CtuPhysicalId, FALSE);
    Bctu_Ip_DisableNotifications(CtuPhysicalId, (BCTU_IP_NOTIF_LIST | BctuNotifAdcUnitFlag));

    if (TRUE == AutosarApi)
    {
        if ((uint8)STD_OFF == GroupPtr->AdcWithoutInterrupt)
        {
#ifdef ADC_DMA_SUPPORTED
            if (ADC_INTERRUPT == CfgPtr->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId])
#endif /* ADC_DMA_SUPPORTED */
            {
                Bctu_Ip_EnableNotifications(CtuPhysicalId, BCTU_IP_NOTIF_LIST);
            }
        }
    }

    TrigConfig.TrigIndex       = (uint8)TriggerSource;
    TrigConfig.LoopEn         = FALSE;
    TrigConfig.DataDest       = BCTU_IP_DATA_DEST_ADC_DATA_REG;
    TrigConfig.HwTriggersEn   = TRUE;
    TrigConfig.AdcTargetMask = (1u << AdcIndexForCtu);

    /* Configure for list mode */
    TrigConfig.TrigType = BCTU_IP_TRIG_TYPE_LIST;

#if (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_ON)
    /* Each CTU trigger group has its own start position in channel list */
    TrigConfig.AdcChanOrListStart = GroupPtr->CtuTrigListPos;
    (void)FirstTrigger;

#else /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF) */
    TrigConfig.AdcChanOrListStart = CfgPtr->AdcIpwConfigPtr->CtuListStartIndex[LogicalHwUnitId];

    /* If this is the first call for this group */
    if (TRUE == FirstTrigger)
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
#else
        ChannelCount = GroupPtr->AssignedChannelCount;
#endif
        /* Initialize all sorted channel list to zero (avoid GCC compiler error) */
        for (Index = 0U; Index < ADC_MAX_CHANNEL_PER_HW_UNIT; Index++)
        {
            ChanList[Index] = 0U;
        }
        Adc_Ipw_GetCtuChanList(ChanList, (uint8)ChannelCount, Group, LogicalHwUnitId, UserId);
        Bctu_Ip_ConfigChanListSimple(CtuPhysicalId, TrigConfig.AdcChanOrListStart, ChanList, ChannelCount);
    }
#endif /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_OFF) */

#if (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_ON)
    if (TRUE == AutosarApi)
    {
        Bctu_Ip_EnableHwTrigger(CtuPhysicalId, TrigConfig.TrigIndex);
    }
    else
#endif /* (ADC_CTU_HW_TRIGGER_OPTIMIZATION == STD_ON) */
    {
        BctuStatus = Bctu_Ip_ConfigTrigger(CtuPhysicalId, &TrigConfig);

        if (BctuStatus != BCTU_IP_STATUS_SUCCESS)
        {
            ReturnStatus = E_NOT_OK;
        }
    }

    /* Enable global trigger for all trigger input */
    Bctu_Ip_SetGlobalTriggerEn(CtuPhysicalId, TRUE);

    return ReturnStatus;
}
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
/**
* @brief          This function enables the hardware trigger for the specified group.
* @details        Autosar Extension API to enable the trigger source configured for the group.
*
* @param[in]      Group           The group for which the hardware triggers will be enabled.
* @param[in]      TriggerSource   Trigger source to be use for the group
* @param[in]      FirstTrigger    Indicates whether trigger source is the first trigger source is enabled
* @param[in]      UserId          UserId
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              If there is no running conversion.
* @retval         E_NOT_OK          If there is a running conversion.
*
*/
Std_ReturnType Adc_Ipw_EnableCtuTrigger(Adc_GroupType Group,
                                        Adc_HwTriggerTimerType TriggerSource,
                                        boolean FirstTrigger,
                                        uint8 UserId)
{
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupConfig = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_HwUnitType LogicalHwUnitId = GroupConfig->AdcLogicalUnitId;
    Std_ReturnType ValidStatus = (Std_ReturnType)E_OK;

    if (TRUE == FirstTrigger)
    {
        Adc_axUnitStatus[LogicalHwUnitId].OngoingHwGroup = Group;
        /* SWS_Adc_00222 */
        /* Mark the Group as BUSY when the Group goes to the Queue or gets started */
        Adc_axGroupStatus[Group].Conversion = ADC_BUSY;
        /* SWS_Adc_00432 */
        /* Put the conversion results from Results Buffer Base Address */
        Adc_axGroupStatus[Group].ResultIndex = 0U;
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
        /* Configure group params (e.g. conversion time) if need before starting conversion */
        Adc_Ipw_PrepareGroupStart(LogicalHwUnitId, GroupConfig, UserId);
#endif /* (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */
    }
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    ValidStatus = Adc_Ipw_BctuTriggerEnable(Group, TriggerSource, FALSE, FirstTrigger, UserId);
#endif /* ADC_IPW_BCTU_AVAILABLE == STD_ON */

#if (ADC_SETCHANNEL_API == STD_ON)
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        /* Roll back to the first sample */
        Adc_axGroupStatus[Group].ResultIndex = 0U;
        /* Reset the update status */
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated =  FALSE;
    }
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

    return ValidStatus;
}

/**
* @brief          This function disables the hardware trigger for the specified group.
* @details        Autosar Extension API to disable the trigger source configured for the group.
*
* @param[in]      Group           The group for which the hardware triggers will be disabled.
* @param[in]      TriggerSource   Trigger source to be use for the group
*
* @return         void
*
*/
void Adc_Ipw_DisableCtuTrigger(Adc_GroupType Group,
                               Adc_HwTriggerTimerType TriggerSource,
                               boolean LastTrigger,
                               uint8 UserId)
{
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupConfig = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_HwUnitType LogicalHwUnitId = GroupConfig->AdcLogicalUnitId;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];

