rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    /* Mapping PhysicalHwUnitId to CtuPhysicalId */
    uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];

    /* Set AdcIndex corresponding to bitfield in BCTU. eg: ADC0-2: BCTU0 and ADC3-6: BCTU1 */
    uint8 AdcIndexForCtu = PhysicalHwUnitId - Adc_Ipw_au8AdcIndexOffset[CtuPhysicalId];

    Bctu_Ip_DisableHwTrigger(CtuPhysicalId, (uint8)TriggerSource);
    /* Clear interrupt flag status */
    Bctu_Ip_ClearStatusFlags(CtuPhysicalId, (BCTU_IP_STATUS_ADC0_NDATA | BCTU_IP_STATUS_ADC0_DATAOVR | BCTU_IP_STATUS_ADC0_LAST) << AdcIndexForCtu);
#endif /* ADC_IPW_BCTU_AVAILABLE == STD_ON */

    if (TRUE == LastTrigger)
    {
        if ((ADC_INVALID_HW_GROUP_ID != Adc_axUnitStatus[LogicalHwUnitId].OngoingHwGroup) && (ADC_CONV_TYPE_INJECTED == GroupConfig->Type))
        {
            Adc_axUnitStatus[LogicalHwUnitId].OngoingHwGroup = ADC_INVALID_HW_GROUP_ID;
        }

        /*Mark the group as IDLE */
        Adc_axGroupStatus[Group].Conversion = ADC_IDLE;

        /* Clear CTU interrupt flag */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_CTU_EOC);
    }
}

/**
* @brief          This function reads the data from the ADC channel hardware data register.
* @details        This Autosar Extension API is used to copy the data from the ADC channel
*                 hardware data register to the ADC group result buffer.
*
* @param[in]      Group           The group for which the data will be read.
* @param[in]      DataPtr        Pointer to a buffer which will be filled by the
*                                 conversion results.
*

* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successful read of the converted data.
* @retval         E_NOT_OK        In case of an ongoing conversion.
*
*/
Std_ReturnType Adc_Ipw_HwResultReadGroup(Adc_GroupType Group,
                                         Adc_ValueGroupType * DataPtr,
                                         uint8 UserId)
{
    Adc_ChannelIndexType Channel;
    Adc_ChannelType LastCh;
    Adc_ChannelType ChIndex;
#if (ADC_SETCHANNEL_API == STD_ON)
    Adc_ChannelType CrtChannel;
    Adc_ChannelIndexType Ch;
#endif
    Adc_ChannelIndexType ChannelCount;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    Adc_GroupType GroupId = ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX;
    Std_ReturnType ChannelEnable = (Std_ReturnType)E_NOT_OK;
    Std_ReturnType ChannelExist = (Std_ReturnType)E_NOT_OK;
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
    Std_ReturnType ReadGroupRet = (Std_ReturnType)E_OK;
    Adc_Sar_Ip_ChanResultType AdcResultLastCh;
    Adc_Sar_Ip_ChanResultType AdcResult;
    uint16 ConvData;
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AdcLogicalUnitId;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    const Adc_Sar_Ip_ConfigType * AdcPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId];
    Adc_HwTriggerTimerType GrHwTriggerSrc = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].HwTriggerSource;

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
    LastCh = AdcPtr->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[0]].ChanIndex;
    for (Ch = 0U; Ch < ChannelCount; Ch++)
    {
        CrtChannel = AdcPtr->ChannelConfigsPtr[Adc_axRuntimeGroupChannel[Group].ChannelPtr[Ch]].ChanIndex;
        if (CrtChannel > LastCh)
        {
            LastCh = CrtChannel;
        }
    }
#else
    ChannelCount = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AssignedChannelCount;
    LastCh = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].LastCh;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /* Get index of the group with AdcEnableChDisableChGroup enabled */
    GroupId = (Adc_GroupType)Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].EnableChDisableChGroupIndex;
    /* Check if group have AdcEnableChDisableChGroup enabled */
    if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupId)
    {
        for (Channel = 0U; Channel < ChannelCount; Channel++)
        {
            ChIndex = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AssignmentPtr[Channel];
            ChannelEnable = Adc_Ipw_IsChannelEnable(LogicalHwUnitId, GroupId, ChIndex, UserId);
            if ((Std_ReturnType)E_OK == ChannelEnable)
            {
                if ((Std_ReturnType)E_NOT_OK == ChannelExist)
                {
                    ChannelExist = (Std_ReturnType)E_OK;
                    LastCh = AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex;
                }
                if (AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex > LastCh)
                {
                    /* Calculate the last channel to check convert status when disableChannel function is invoked */
                    LastCh = AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex;
                }
            }
        }
    }
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
#endif
    if (GrHwTriggerSrc <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
        Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, LastCh, ADC_SAR_IP_CONV_CHAIN_CTU, &AdcResultLastCh);
    }
    else
    {
        Adc_Sar_Ip_ConvChainType convChainType = (Adc_Sar_Ip_ConvChainType)Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Type;
        Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, LastCh, convChainType, &AdcResultLastCh);
    }

    if (TRUE == AdcResultLastCh.ValidFlag)
    {
        /* Result for LastCh is valid, so all conversions from the group have been completed */
        for (Channel = 0U; Channel < ChannelCount; Channel++)
        {
#if (ADC_SETCHANNEL_API == STD_ON)
            ChIndex = Adc_axRuntimeGroupChannel[Group].ChannelPtr[Channel];
#else
            ChIndex = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].AssignmentPtr[Channel];
#endif
            if ((uint32)AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex != LastCh)
            {
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
                /* Get index of the group with AdcEnableChDisableChGroup enabled */
                GroupId = (Adc_GroupType)Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].EnableChDisableChGroupIndex;
                /* Check if group have AdcEnableChDisableChGroup enabled */
                if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupId)
                {
                    ChannelEnable = Adc_Ipw_IsChannelEnable(LogicalHwUnitId, GroupId, ChIndex, UserId);
                }
                else
                {
                    ChannelEnable = (Std_ReturnType)E_OK;
                }
                /* If channel is enable, check valid and result bit */
                if ((Std_ReturnType)E_OK == ChannelEnable)
                {
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
                    if (GrHwTriggerSrc <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
                    {
                        Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), ADC_SAR_IP_CONV_CHAIN_CTU, &AdcResult);
                    }
                    else
                    {
                        Adc_Sar_Ip_ConvChainType convChainType = (Adc_Sar_Ip_ConvChainType)Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Type;
                        Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), convChainType, &AdcResult);
                    }
                    if (FALSE == AdcResult.ValidFlag)
                    {
                        ReadGroupRet = (Std_ReturnType)E_NOT_OK;
                        break;
                    }
                    ConvData = AdcResult.ConvData;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
                }
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
            }
            else
            {
                /* For LastChan do not read again the result, but use the result already read */
                ConvData = AdcResultLastCh.ConvData;
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
                /* The Last Channel is always enabled */
                ChannelEnable = (Std_ReturnType)E_OK;
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
            }
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
            if ((Std_ReturnType)E_OK == ChannelEnable)
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
            {
                DataPtr[Channel] = ConvData;
            }
        }
    }
    else
    {
        ReadGroupRet = (Std_ReturnType)E_NOT_OK;
    }

