rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    return ReadGroupRet;
}
#endif /* ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON */
#endif /* ADC_HW_TRIGGER_API == STD_ON */

#if (ADC_READ_GROUP_API == STD_ON)

static inline Std_ReturnType Adc_Ipw_ReadGroupAdcSar(const Adc_GroupType Group,
                                                     Adc_ValueGroupType * DataPtr,
                                                     boolean * Flag,
                                                     uint8 UserId)
{
    Std_ReturnType ReadGroupRet = (Std_ReturnType)E_OK;
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;

    /* If the group is configured for without interrupts */
    if ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt)
    {
        /* Return error if group is not at the first of queue */
        if (ADC_CONV_TYPE_NORMAL == GroupPtr->Type)
        {
            if (ADC_TRIGG_SRC_SW == GroupPtr->TriggerSource)
            {
                if (Group != Adc_axUnitStatus[LogicalHwUnitId].SwNormalQueue[0])
                {
                    ReadGroupRet = (Std_ReturnType)E_NOT_OK;
                }
            }
#if (STD_ON == ADC_HW_TRIGGER_API)
            else
            {
                if (Group != Adc_axUnitStatus[LogicalHwUnitId].OngoingHwGroup)
                {
                    ReadGroupRet = (Std_ReturnType)E_NOT_OK;
                }
            }
#endif /* (STD_ON == ADC_HW_TRIGGER_API) */
        }
        if ((Std_ReturnType)E_OK == ReadGroupRet)
        {
            ReadGroupRet = Adc_Ipw_ReadGroupNoInt(Group, DataPtr, Flag, UserId);
        }
    }
    else  /* If the group is configured with interrupts */
    {
        if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
        {
            ReadGroupRet = (Std_ReturnType)E_NOT_OK;
        }
        else
        {
            Adc_Ipw_ReadGroupIntAdcSar(Group, DataPtr, UserId);
        }
    }

    return ReadGroupRet;
}

static inline void Adc_Ipw_ReadGroupIntAdcSar(const Adc_GroupType Group,
                                                Adc_ValueGroupType * DataPtr,
                                                uint8 UserId)
{
    Adc_ChannelIndexType ChannelCount;
    const Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_ChannelIndexType Index = 0U;
    Adc_ValueGroupType * ResultPtr = NULL_PTR;
    uint32 DestOffset = (uint32)0UL;
    Adc_StreamNumSampleType ResultIndex = 0U;

#ifdef ADC_DMA_SUPPORTED
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;

    /* When DMA is used, the masking result is required according to safety analysis. Interrupt was done by Adc_Sar_Ip_GetConvResult. */
    Adc_Sar_Ip_ChanResultType AdcResult;
    
    uint8 Res;
    const Adc_Sar_Ip_DataAlignedType DataAlign = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->DataAlign;

    /* If BypassResolution enabled, number of bits in results always are 15 even the resolution is lower than. */
    if (FALSE == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->BypassResolution)
    {
        Res = Adc_Ipw_au8AvailableResolutions[(uint8)(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->AdcResolution)];
    }
    else
    {
        Res = ADC_SAR_IP_RESULT_RESOLUTION;
    }
#endif /*ADC_DMA_SUPPORTED*/

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
#else
    ChannelCount = GroupPtr->AssignedChannelCount;
#endif
    /* Get index of last completed sample */
    ResultIndex = Adc_axGroupStatus[Group].ResultIndex - (Adc_StreamNumSampleType)1U;
    if ((Adc_StreamNumSampleType)0U == Adc_axGroupStatus[Group].ResultIndex)
    {
        ResultIndex = GroupPtr->NumSamples - (Adc_StreamNumSampleType)1U;
    }

#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    /* Get the result buffer pointer */
    if (FALSE == GroupPtr->StreamResultGroupMultiSets)
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
    {
        ResultPtr = (Adc_ValueGroupType *)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[ResultIndex]));
        DestOffset = GroupPtr->NumSamples;

        /* Copy results of last conversion from streaming buffer to internal buffer */
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId])
        {
            for (Index = 0U; Index < ChannelCount; Index++)
            {
                Adc_Ipw_MaskConvResult((*ResultPtr), &AdcResult, TRUE, Res, DataAlign);
                DataPtr[Index] = AdcResult.ConvData;
                ResultPtr = &(ResultPtr[DestOffset]);
            }
        }
        else
#endif /* ADC_DMA_SUPPORTED */
        {
            for (Index = 0U; Index < ChannelCount; Index++)
            {
                /* When DMA disabled, results are already masked by Adc_Sar_Ip_GetConvResult.*/
                DataPtr[Index] = (*ResultPtr);
                ResultPtr = &(ResultPtr[DestOffset]);
            }
        }
    }
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    else
    {
        ResultPtr = (Adc_ValueGroupType *)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[ResultIndex * ChannelCount]));
        /* Copy results of last conversion from streaming buffer to internal buffer */
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId])
        {
            for (Index = 0U; Index < ChannelCount; Index++)
            {
                Adc_Ipw_MaskConvResult(ResultPtr[Index], &AdcResult, TRUE, Res, DataAlign);
                DataPtr[Index] = AdcResult.ConvData;
            }
        }
        else
#endif /* ADC_DMA_SUPPORTED */
        {
            for (Index = 0U; Index < ChannelCount; Index++)
            {
                /* When DMA disabled, results are already masked by Adc_Sar_Ip_GetConvResult.*/
                DataPtr[Index] = ResultPtr[Index];
            }
        }
    }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
}


