rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
#if (ADC_IPW_SDADC_IS_USED == STD_ON)

static inline Std_ReturnType Adc_Ipw_ReadGroupNoIntSdAdc(const Adc_GroupType Group,
                                                         Adc_ValueGroupType * DataPtr,
                                                         boolean * Flag,
                                                         uint8 UserId)
{
    const Adc_GroupType              GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    const Adc_HwUnitType        LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const Adc_HwUnitType       PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    Std_ReturnType                 ReadGroupRet = (Std_ReturnType)E_OK;
    uint32                            ConvLength;
    uint16                            ConvData = 0U;
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
    const uint32 AdcDmaLogicChId = (uint32) Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
#endif /*ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED*/
#else
    /* Avoid compiler warning */
    (void)Flag;
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */

    /* Get the last converted sample */
#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    if ( (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) &&
         (FALSE   == GroupPtr->AdcWithoutDma)
       )
    {
        /* Get the result from DMA buffer */
        if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
        {
            ConvData = (uint16)(Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][0U]);
        }
        else
        {
            ConvData = Adc_axGroupStatus[Group].ResultsBufferPtr[0U];
        }

        /* Check if the result is valid */
        if (ADC_IPW_INVALID_DATA_RESULT_DMA == ConvData)
        {
            ReadGroupRet = (Std_ReturnType)E_NOT_OK;  /* Invalid data */
        }
        else
        {
            /* Because the conversion was completed, the buffer needs to be reset to invalid value before starting next conversion */
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                Adc_Ipw_au32DmaNoIrqBuffer[PhysicalHwUnitId][0U] = ADC_IPW_INVALID_DATA_RESULT_DMA;
            }
            else
            {
                Adc_axGroupStatus[Group].ResultsBufferPtr[0U] = ADC_IPW_INVALID_DATA_RESULT_DMA;
            }
        }
    }
    else
#endif /*ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */
    {
        /* Get the result from hardware */
        ConvLength = Sdadc_Ip_GetConvData((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET, 1U, (sint16 *)(&ConvData) );
        /* Check if the result is valid */
        if (ConvLength != 1U)
        {
            ReadGroupRet = (Std_ReturnType)E_NOT_OK;  /* Invalid data */
        }
    }

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/* Checks if conversion values are in the configured range */
    if (TRUE == GroupPtr->AdcGroupLimitcheck)
    {
        if (FALSE == Adc_Ipw_CheckConversionValuesInRange(ConvData, LogicalHwUnitId, GroupPtr->AssignmentPtr[0U], UserId))
        {
            *Flag = FALSE;
            /* SWS_Adc_00448, SWS_Adc_00449, SWS_Adc_00450 */
            Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;
            ReadGroupRet = (Std_ReturnType)E_NOT_OK;
#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
            if ((ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) && ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable))
            {
                /* If the Result Conversion is out of range, need to reset Destination Address to previous Buffer Address. */
                /* Because the Destination Offset for Streaming Group that has one channel configured be 4U to reducing additional in the callback. */
                if (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
                {
                    LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
                    LocTransferList[0].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]));
                    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
                }
            }
#endif /*ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED*/
        }
        else
        {
            Adc_axGroupStatus[Group].LimitCheckFailed = FALSE;
        }
    }
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

    /* Copy data to user's buffer */
    if ((Std_ReturnType)E_OK == ReadGroupRet)
    {
        DataPtr[0U] = ConvData;
    }

    return ReadGroupRet;
}


static inline Std_ReturnType Adc_Ipw_ReadGroupSdAdc(const Adc_GroupType Group,
                                                    Adc_ValueGroupType * DataPtr,
                                                    boolean * Flag,
                                                    uint8 UserId)
{
    Std_ReturnType                 ReadGroupRet = (Std_ReturnType)E_OK;
    const Adc_GroupType              GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    const Adc_HwUnitType        LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    Adc_StreamNumSampleType         ResultIndex;

    /* If the group is configured for without interrupts */
    if ((uint8)STD_ON == GroupPtr->AdcWithoutInterrupt)
    {
        /* Return error if group is not at the first of queue */

#if (STD_ON == ADC_HW_TRIGGER_API)
        if (ADC_TRIGG_SRC_HW == GroupPtr->TriggerSource)
        {
            if (Group != Adc_axUnitStatus[LogicalHwUnitId].OngoingHwGroup)
            {
                ReadGroupRet = (Std_ReturnType)E_NOT_OK;
            }
        }
        else
#endif /* (STD_ON == ADC_HW_TRIGGER_API) */
        {
            if (Group != Adc_axUnitStatus[LogicalHwUnitId].SwNormalQueue[0U])
            {
                ReadGroupRet = (Std_ReturnType)E_NOT_OK;
            }
        }

        if ((Std_ReturnType)E_OK == ReadGroupRet)
        {
            ReadGroupRet = Adc_Ipw_ReadGroupNoIntSdAdc(Group, DataPtr, Flag, UserId);
        }
    }
    else  /* If the group is configured with interrupts */
    {
        if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
        {
            ReadGroupRet = (Std_ReturnType)E_NOT_OK;
        }
        else
        {
            /* Get index of last completed sample */
            if ((Adc_StreamNumSampleType)0U == Adc_axGroupStatus[Group].ResultIndex)
            {
                ResultIndex = GroupPtr->NumSamples - (Adc_StreamNumSampleType)1U;
            }
            else
            {
                ResultIndex = Adc_axGroupStatus[Group].ResultIndex - (Adc_StreamNumSampleType)1U;
            }

