rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
            /* Result is already available in Group's buffer */
            DataPtr[0U] = Adc_axGroupStatus[Group].ResultsBufferPtr[ResultIndex];
        }
    }

    return ReadGroupRet;
}

#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */


/**
* @brief          This function reads the converted data for the requested group.
* @details        Reads the converted data for the requested group.
*
* @param[in]      Group           The group number.
* @param[in]      DataPtr        Pointer to a buffer which will be filled by the
*                                 conversion results.
* @param[in]      Flag
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successful read of the converted data.
* @retval         E_NOT_OK        In case of an ongoing conversion.
*
*/
Std_ReturnType Adc_Ipw_ReadGroup(const Adc_GroupType Group,
                                 Adc_ValueGroupType * DataPtr,
                                 boolean * Flag,
                                 uint8 UserId)
{
    Std_ReturnType ReadGroupRet;

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    const Adc_GroupType              GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    const Adc_HwUnitType        LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const Adc_HwUnitType       PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];

    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        ReadGroupRet = Adc_Ipw_ReadGroupSdAdc(Group, DataPtr, Flag, UserId);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        ReadGroupRet = Adc_Ipw_ReadGroupAdcSar(Group, DataPtr, Flag, UserId);
    }

    return ReadGroupRet;
}
#endif /* (ADC_READ_GROUP_API == STD_ON) */

#if (ADC_ENABLE_READ_RAW_DATA_API == STD_ON)
/* Get the Conversion Data of Channel */
Std_ReturnType Adc_Ipw_GetConvData(Adc_HwUnitType Unit,
                                   Adc_ChannelType ChnIdx,
                                   uint8 UserId,
                                   uint16 * Result)
{
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    Std_ReturnType ValidStatus = (Std_ReturnType)E_OK;

#if (ADC_IPW_SDADC_IS_USED == STD_ON) 
    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        if(1U != Sdadc_Ip_GetRawConvDataFifo(((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET), 1U, (sint16 *)Result))
        {
            ValidStatus = E_NOT_OK;
        }
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        *Result = Adc_Sar_Ip_GetConvData(PhysicalHwUnitId, (uint32)ChnIdx);
    }

    return ValidStatus;
}
#endif /* (ADC_ENABLE_READ_RAW_DATA_API == STD_ON) */

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)

/* Limit check for ADCSAR and SDADC (Both Sign and Unsign cases) */
static inline boolean Adc_Ipw_IsValueInRange(const Adc_ValueGroupType Value,
                                             const Adc_ChannelRangeSelectType ChRange,
                                             const Adc_ValueGroupType LowLimit,
                                             const Adc_ValueGroupType HighLimit,
                                             const boolean SignChecking)
{
    boolean ValInRange = FALSE;

    /* Local variables to perform the checks in both signed and unsigned cases */
    sint32 LocalLowLimit;
    sint32 LocalHighLimit;
    sint32 LocalValueLimit;

    if (TRUE == SignChecking)
    {
        /* Cast through "sint16" first to preserve signed bit */
        LocalLowLimit   = (sint32)( (sint16)LowLimit  );
        LocalHighLimit  = (sint32)( (sint16)HighLimit );
        LocalValueLimit = (sint32)( (sint16)Value     );
    }
    else
    {
        /* Cast directly to "sint32" to ignore sign bit */
        LocalLowLimit   = (sint32)( LowLimit  );
        LocalHighLimit  = (sint32)( HighLimit );
        LocalValueLimit = (sint32)( Value     );
    }

    switch (ChRange)
    {
        /* Complete range - independent from channel limit settings. */
        case ADC_RANGE_ALWAYS:
        {
            ValInRange = TRUE;
            break;
        }

        /* Range between low limit and high limit - high limit value included. */
        case ADC_RANGE_BETWEEN:
        {
            if ((LocalValueLimit > LocalLowLimit) && (LocalValueLimit <= LocalHighLimit))
            {
                ValInRange = TRUE;
            }
            break;
        }

        /* Range above high limit or below low limit - low limit value included. */
        case ADC_RANGE_NOT_BETWEEN:
        {
            if ((LocalValueLimit > LocalHighLimit) || (LocalValueLimit <= LocalLowLimit))
            {
                ValInRange = TRUE;
            }
            break;
        }

        /* Range below high limit -high limit value included. */
        case ADC_RANGE_NOT_OVER_HIGH:
        {
            if (LocalValueLimit <= LocalHighLimit)
            {
                ValInRange = TRUE;
            }
            break;
        }
        /* Range above low limit. */
        case ADC_RANGE_NOT_UNDER_LOW:
        {
            if (LocalValueLimit > LocalLowLimit)
            {
                ValInRange = TRUE;
            }
            break;
        }

        /* Range above high limit. */
        case ADC_RANGE_OVER_HIGH:
        {
            if (LocalValueLimit > LocalHighLimit)
            {
                ValInRange = TRUE;
            }
            break;
        }

        /* Range below low limit - low limit value included. */
        case ADC_RANGE_UNDER_LOW:
        {
            if (LocalValueLimit <= LocalLowLimit)
            {
                ValInRange = TRUE;
            }
            break;
        }

        /* Unexpected value */
        default:
        {
            ; /* no-op */
            break;
        }
    }

    return ValInRange;
}

/**
* @brief          Checks if conversion values are in the configured range.
* @details        Return true if conversion values are in the configured range, otherwise false.
*
* @param[in]      value       Adc conversion value.
*                 Unit        Adc Hardware Unit.
*                 Index       Adc channel index assigned to a group.
*                 UserId       Current UserId
*
* @return         boolean     Conversion value in range flag.
* @retval         TRUE        if conversion values are in the configured range.
* @retval         FALSE       if conversion values are not in the configured range.
*
* @pre            Driver must be initialized.
*/
boolean Adc_Ipw_CheckConversionValuesInRange(Adc_ValueGroupType Value,
                                             Adc_HwUnitType LogicalHwUnitId,
                                             Adc_ChannelType ChannelIndex,
                                             uint8 UserId)
{
    const Adc_ChannelLimitCheckingType * const LimitCfg = &(Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcIpwChannelConfig[LogicalHwUnitId][ChannelIndex].ChannelLimitCheckingConfig);
    Adc_ValueGroupType LocalValue = Value;
    boolean SignCheck             = FALSE;
    boolean ValInRange;

#if (STD_ON == ADC_IPW_SDADC_IS_USED)
    const Adc_HwUnitType          PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
    const Sdadc_Ip_ResolutionType SdAdcResolution  = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->Resolution;

    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        if (SDADC_IP_RESOLUTION_16 == SdAdcResolution)
        {
            SignCheck = TRUE;
        }
    }
    else
#endif
    {
        /* ADCSAR */
#if (ADC_RESULT_ALIGNMENT == ADC_ALIGN_LEFT)
    LocalValue = (LocalValue & ADC_IPW_DATA_MASK_U16) >> (16U - ADC_SAR_IP_RESULT_RESOLUTION);
#else
    LocalValue =  LocalValue & (ADC_IPW_DATA_MASK_U16 >> (16U - ADC_SAR_IP_RESULT_RESOLUTION));
#endif /* (ADC_RESULT_ALIGNMENT == ADC_ALIGN_LEFT) */
    }

