rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    ValInRange = Adc_Ipw_IsValueInRange(LocalValue, LimitCfg->ChannelRange, LimitCfg->ChannelLowLimit, LimitCfg->ChannelHighLimit, SignCheck);

    return ValInRange;
}
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
/**
 * @brief   Function to reconfigure High and Low thresholds for a given threshold control index.
 * @details This function is used to reconfigure High and Low thresholds for a given threshold control index.
 *
 * @param[in]  ThresholdControlIndex Symbolic names of threshold control register with encoded value
 * @param[in]  LowValue              Low threshold value of the threshold control
 * @param[in]  HighValue             High threshold value of the threshold control
 * @param[in]  UserId                Current UserId
 *
 * @return         Std_ReturnType    E_OK or E_NOT_OK.
 * @retval         E_OK              All checking is ok.
 * @retval         E_NOT_OK          Threshold control index is out of range or the configured threshold control is disabled.
 */
Std_ReturnType Adc_Ipw_ConfigureThreshold(Adc_ThresholdControlIndexType ThresholdControlIndex,
                                          Adc_ValueGroupType LowValue,
                                          Adc_ValueGroupType HighValue,
                                          uint8 UserId)
{
    Std_ReturnType Status;

#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    const Adc_HwUnitType  LogicalHwUnitId = (uint8)(ThresholdControlIndex >> ADC_THRESHOLD_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16);
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];

    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
       /* SDADC */
       Status = Adc_Ipw_ConfigureThresholdSdAdc(ThresholdControlIndex, LowValue, HighValue, UserId);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
       /* ADCSAR */
       Status = Adc_Ipw_ConfigureThresholdAdcSar(ThresholdControlIndex, LowValue, HighValue, UserId);
    }

    return Status;
}
#endif /* if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON) */

#ifdef ADC_WDG_SUPPORTED
/**
 * @brief   Enable notification of a channel that has watchdog functionality configured at initialization
 * @details Enable notification of a channel that has watchdog functionality configured at initialization
 *
 * @param[in]   Unit                Logical Unit Id
 * @param[in]   ChannelId           AUTOSAR Symbolic name of channel
 * @param[in]   UserId           Current UserId
 *
 * @return      Std_ReturnType      E_OK or E_NOT_OK.
 * @retval      E_OK                All checking is ok.
 * @retval      E_NOT_OK            Channel does not have wdg associated/configured at init
 *
 */
Std_ReturnType Adc_Ipw_EnableWdgNotification(Adc_HwUnitType Unit,
                                             Adc_ChannelType ChannelId,
                                             uint8 UserId)
{
    Std_ReturnType                  Status = E_NOT_OK;
    const Adc_HwUnitType  PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_ChannelType LogicalChannelId = ChannelId & ADC_CHANNEL_SYMBOLIC_NAME_MASK_CHANNEL_ID_U16;
    Adc_ChannelType      PhysicalChannelId;

    /* Check to avoid out of bound index */
    if ( (LogicalChannelId < Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcChannels[Unit]) &&
         (NULL_PTR != Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcIpwChannelConfig[Unit][LogicalChannelId].WdgNotification)
       )
    {
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
        if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
        {
            /* SDADC */
            Sdadc_Ip_EnableWatchdog((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET);
        }
        else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
        {
            /* Adc_Sar */
            /* Enable CWENR bit field associated with this channel */
            PhysicalChannelId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit]->ChannelConfigsPtr[LogicalChannelId].ChanIndex;
            Adc_Sar_Ip_EnableChannelNotifications(PhysicalHwUnitId, PhysicalChannelId, ADC_SAR_IP_CHAN_NOTIF_WDG);
        }

        /* Wdg notif was enabled successfully */
        Status = E_OK;
    }

    return Status;
}

/**
 * @brief   Disable notification of a channel that has watchdog functionality configured at initialization
 * @details Disable notification of a channel that has watchdog functionality configured at initialization
 *
 * @param[in]   Unit                Logical Unit Id
 * @param[in]   ChannelId           AUTOSAR Symbolic name of channel
 * @param[in]   UserId           Current UserId
 *
 * @return      Std_ReturnType      E_OK or E_NOT_OK.
 * @retval      E_OK                All checking is ok.
 * @retval      E_NOT_OK            Channel does not have wdg associated/configured at init
 *
 */
Std_ReturnType Adc_Ipw_DisableWdgNotification(Adc_HwUnitType Unit,
                                              Adc_ChannelType ChannelId,
                                              uint8 UserId)
{
    Std_ReturnType                  Status = E_NOT_OK;
    const Adc_HwUnitType  PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_ChannelType LogicalChannelId = ChannelId & ADC_CHANNEL_SYMBOLIC_NAME_MASK_CHANNEL_ID_U16;
    Adc_ChannelType      PhysicalChannelId;

    /* Check to avoid out of bound index */
    if ( (LogicalChannelId < Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcChannels[Unit]) &&
         (NULL_PTR != Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcIpwChannelConfig[Unit][LogicalChannelId].WdgNotification)
       )
    {
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
        if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
        {
            /* SDADC */
            Sdadc_Ip_DisableWatchdog((uint32)PhysicalHwUnitId - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET);
        }
        else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
        {
            /* Adc_Sar */
            /* Enable CWENR bit field associated with this channel */
            PhysicalChannelId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit]->ChannelConfigsPtr[LogicalChannelId].ChanIndex;
            Adc_Sar_Ip_DisableChannelNotifications(PhysicalHwUnitId, PhysicalChannelId, ADC_SAR_IP_CHAN_NOTIF_WDG);
        }

