rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
        /* Wdg notif was disabled successfully */
        Status = E_OK;
    }

    return Status;
}
#endif /* ADC_WDG_SUPPORTED */

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
/**
* @brief          This function sets the Prescaler value only when ADC is in power down mode.
* @details        Set prescaler clock divider only in power down mode.
*
* @param[in]      Prescaler       ADC_NORMAL, ADC_ALTERNATE.
* @param[in]      UserId          Current UserId
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successful set hw unit power mode.
* @retval         E_NOT_OK        In case of unsuccessful set hw unit power mode.
*
*/
Std_ReturnType Adc_Ipw_SetClockMode(Adc_SelectPrescalerType Prescaler,
                                    uint8 UserId)
{
    Adc_HwUnitType LogicalHwUnitId = 0U; /* Logical Unit Id */
    Adc_HwUnitType PhysicalHwUnitId = 0U; /* Physical Hardware Unit Id */
    Adc_Sar_Ip_StatusType AdcSarStatus;
    Adc_Sar_Ip_ClockConfigType AdcNormalClockConfig;
    const Adc_Sar_Ip_ConfigType * AdcPtr;
    Std_ReturnType Status = E_OK;
#if FEATURE_ADC_HAS_CONVERSION_TIMING
    uint8 Iter;
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */

    for (LogicalHwUnitId = 0U; LogicalHwUnitId < ADC_IPW_MAX_HW_UNITS; LogicalHwUnitId++)
    {
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[LogicalHwUnitId] == (uint8)STD_ON) /* HW unit enabled on current partition */
        {
            PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
            AdcPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId];
            if (Prescaler == ADC_NORMAL)
            {
#if FEATURE_ADC_HAS_CONVERSION_TIMING
                for (Iter = 0; Iter < ADC_SAR_IP_NUM_GROUP_CHAN; Iter++)
                {
                    AdcNormalClockConfig.SampleTimeArr[Iter] = AdcPtr->SampleTimeArr[Iter];
                }
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */
                AdcNormalClockConfig.ClkSelect = AdcPtr->ClkSelect;
#if FEATURE_ADC_HAS_HIGH_SPEED_ENABLE
                AdcNormalClockConfig.HighSpeedConvEn = AdcPtr->HighSpeedConvEn;
#endif /* FEATURE_ADC_HAS_HIGH_SPEED_ENABLE */
                AdcNormalClockConfig.PowerDownDelay = AdcPtr->PowerDownDelay;
#if FEATURE_ADC_HAS_AVERAGING
                AdcNormalClockConfig.AvgEn = AdcPtr->AvgEn;
                AdcNormalClockConfig.AvgSel = AdcPtr->AvgSel;
#endif /* FEATURE_ADC_HAS_AVERAGING */
                AdcSarStatus = Adc_Sar_Ip_SetClockMode(PhysicalHwUnitId, &AdcNormalClockConfig);
            }
            else
            {
                AdcSarStatus = Adc_Sar_Ip_SetClockMode(PhysicalHwUnitId, Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcAltClockConfig[LogicalHwUnitId]);
            }

            if (AdcSarStatus != ADC_SAR_IP_STATUS_SUCCESS)
            {
                Status = E_NOT_OK;
                break;
            }
        }
    }

    return Status;
}
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

#if (ADC_SET_HW_UNIT_POWER_MODE_API == STD_ON)
/**
* @brief          This function sets the PWDN bit while going in power down mode or clears it
*                 upon exit from power down mode.
* @details        Set power down/normal mode.
*
* @param[in]      SetHwUnitPowerMode         ADC_NORMAL_MODE, ADC_POWER_DOWN_MODE.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successful set hw unit power mode.
* @retval         E_NOT_OK        In case of unsuccessful set hw unit power mode.
*
*/
Std_ReturnType Adc_Ipw_SetHwUnitPowerMode(Adc_HwUnitType Unit,
                                          Adc_SetPowerModeType SetHwUnitPowerMode,
                                          uint8 UserId)
{
    Std_ReturnType ReturnStatus = (Std_ReturnType)E_OK;
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    if (ADC_POWER_DOWN_MODE == SetHwUnitPowerMode)
    {
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
        /* CTUSTART is reset by HW after each CTU conv is finished only if CTU is in triggered mode */
        if (FALSE == Adc_axUnitStatus[Unit].CtuControlOngoing)
        {
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
            if ((Adc_Sar_Ip_GetStatusFlags(PhysicalHwUnitId) & ADC_SAR_IP_STATUS_FLAG_CTU_STARTED) != 0u)
            {
                ReturnStatus = (Std_ReturnType)E_NOT_OK;
            }
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
        }
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

        /* enter into power-down Mode */
        if (ReturnStatus == (Std_ReturnType)E_OK)
        {
            if (ADC_SAR_IP_STATUS_SUCCESS != Adc_Sar_Ip_Powerdown(PhysicalHwUnitId))
            {
                ReturnStatus = (Std_ReturnType)E_NOT_OK;
            }
        }
    }
    else
    {
        /* Exit from PowerDown Mode */
        if (ADC_SAR_IP_STATUS_SUCCESS != Adc_Sar_Ip_Powerup(PhysicalHwUnitId))
        {
            ReturnStatus = (Std_ReturnType)E_NOT_OK;
        }
    }

    return ReturnStatus;
}
#endif /* (ADC_SET_HW_UNIT_POWER_MODE_API == STD_ON) */

#if ((ADC_POWER_STATE_SUPPORTED == STD_ON) || (ADC_SET_HW_UNIT_POWER_MODE_API == STD_ON))
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
/* The next condition is true if CTU/BCTU Unit is used */
#if ((ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
/**
* @brief          This function turns on or puts the CTU unit in power down mode.
* @details        Set CTU power down/normal mode.
*
* @param[in]      CtuUnit         CTU hardware unit
* @param[in]      State           Target power state
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            Transition successful.
* @retval         E_NOT_OK        CTU unit out of range.
*
*/
Std_ReturnType Adc_Ipw_CtuSetPowerMode(Adc_HwUnitType CtuUnit,
                                       Adc_PowerStateType State)
{
    Std_ReturnType ReturnStatus = (Std_ReturnType)E_NOT_OK;
    boolean LowPowerMode = (State == ADC_LOW_POWER) ? TRUE : FALSE;

