rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    /* Check if CTU unit is out of range */
    if (CtuUnit < ADC_IPW_CTU_MAX_HW_UNITS)
    {
        if (State != ADC_NODEFINE_POWER)
        {
            Bctu_Ip_SetLowPowerMode((uint32)CtuUnit, LowPowerMode);
            ReturnStatus = (Std_ReturnType)E_OK;
        }
    }

    return ReturnStatus;
}
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || */
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
#endif /* ((ADC_POWER_STATE_SUPPORTED == STD_ON) || (ADC_SET_HW_UNIT_POWER_MODE_API == STD_ON)) */

#if (ADC_POWER_STATE_SUPPORTED == STD_ON)
/**
* @brief          Set the desired power state.
* @details        This API changes power state of ADC module.
*
* @param[in]      PowerState     The power state to set
* @param[in]      UserId         Current UserId
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Power Mode changed.
* @retval         E_NOT_OK:       Request rejected.
*
* @api
*
*/
Std_ReturnType Adc_Ipw_SetPowerState(Adc_PowerStateType PowerState,
                                     uint8 UserId)
{
    Adc_HwUnitType LogicalHwUnitId;
    Adc_HwUnitType PhysicalHwUnitId;
    Adc_Sar_Ip_StatusType AdcSarStatus = ADC_SAR_IP_STATUS_ERROR;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
#if ((ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
    uint8 CtuPhysicalId = 0;
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || */
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

    for (LogicalHwUnitId = 0U; LogicalHwUnitId < ADC_IPW_MAX_HW_UNITS; LogicalHwUnitId++)
    {
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[LogicalHwUnitId] == (uint8)STD_ON) /* HW unit enabled on current partition */
        {
            PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[LogicalHwUnitId];
            #if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
            /* The next condition is true if CTU/BCTU Unit is used */
            #if ((ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
                /* Mapping PhysicalHwUnitId to CtuPhysicalId */
                CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];
                ReturnValue = Adc_Ipw_CtuSetPowerMode(CtuPhysicalId, PowerState);
            #endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || */
            #endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
            if (ADC_FULL_POWER == PowerState)
            {
                /* comes out from PowerDown */
                AdcSarStatus = Adc_Sar_Ip_Powerup(PhysicalHwUnitId);
            }
            else if (ADC_LOW_POWER == PowerState)
            {
                /* enter into power-down mode */
                AdcSarStatus = Adc_Sar_Ip_Powerdown(PhysicalHwUnitId);
            }
            else
            {
                ; /* Empty else branch to avoid MISRA */
            }

            if ((AdcSarStatus != ADC_SAR_IP_STATUS_SUCCESS) || (ReturnValue != (Std_ReturnType)E_OK))
            {
                ReturnValue = (Std_ReturnType)E_NOT_OK;
                break;
            }
        }
    }

    return ReturnValue;
}
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */

#if (ADC_CALIBRATION == STD_ON)
void Adc_Ipw_Calibrate(Adc_HwUnitType Unit,
                       Adc_CalibrationStatusType * Status,
                       uint8 UserId)
{
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    Status->AdcUnitSelfTestStatus = E_OK;

    /* Call IPL calibration function */
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        PhysicalHwUnitId -= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
        if (SDADC_IP_STATUS_SUCCESS != Sdadc_Ip_DoCalibration(PhysicalHwUnitId))
        {
            Status->AdcUnitSelfTestStatus = E_NOT_OK;
        }
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        if (ADC_SAR_IP_STATUS_SUCCESS != Adc_Sar_Ip_DoCalibration(PhysicalHwUnitId))
        {
            Status->AdcUnitSelfTestStatus = E_NOT_OK;
        }
    }
}

Std_ReturnType Adc_Ipw_SetUserGainAndOffset(const Adc_HwUnitType Unit,
                                            const uint8 UserId,
                                            const Adc_UserGainType Gain,
                                            const Adc_UserOffsetType Offset)
{
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Call IPL set user gain and offset function */
#if (ADC_IPW_SDADC_IS_USED == STD_ON)
    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* SDADC */
        PhysicalHwUnitId -= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
        Sdadc_Ip_SetUserGainAndOffset(PhysicalHwUnitId, (sint32)Gain, (sint32)Offset);
    }
    else
#endif /* (ADC_IPW_SDADC_IS_USED == STD_ON) */
    {
        /* ADCSAR */
        Adc_Sar_Ip_SetUserGainAndOffset(PhysicalHwUnitId, (uint16)Gain, (uint8)Offset);
    }

    return ReturnValue;
}
#endif /* ADC_CALIBRATION == STD_ON */

#if (ADC_APPLY_CALIBRATION == STD_ON)
Std_ReturnType Adc_Ipw_ApplyCalibration(const Adc_HwUnitType Unit,
                                        const uint8 UserId,
                                        const uint32 BufferLength,
                                        const sint16 * const UncalibratedBuffer,
                                        sint16 * const CalibratedBuffer)
{
    Std_ReturnType ReturnValue      = (Std_ReturnType)E_NOT_OK;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    if (PhysicalHwUnitId >= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET)
    {
        /* Call IPL apply calibration function */
        PhysicalHwUnitId -= ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
        Sdadc_Ip_ApplyCalibration(PhysicalHwUnitId, BufferLength, UncalibratedBuffer, CalibratedBuffer);
        /* Mark return value as successful */
        ReturnValue = (Std_ReturnType)E_OK;
    }

