rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    return ReturnValue;
}
#endif /* ADC_APPLY_CALIBRATION == STD_ON */

#if (ADC_SELF_TEST == STD_ON)
Std_ReturnType Adc_Ipw_SelfTest(Adc_HwUnitType Unit,
                                uint8 UserId)
{
    Adc_Sar_Ip_StatusType AdcSarStatus;
    Std_ReturnType Status = (Std_ReturnType)E_NOT_OK;
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    AdcSarStatus = Adc_Sar_Ip_SelfTest(PhysicalHwUnitId);

    if (AdcSarStatus == ADC_SAR_IP_STATUS_SUCCESS)
    {
        Status = (Std_ReturnType)E_OK;
    }
    else if (AdcSarStatus == ADC_SAR_IP_STATUS_ERROR)
    {
        Status = (Std_ReturnType)E_NOT_OK;
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }

    return Status;
}
#endif /* ADC_SELF_TEST == STD_ON */

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
/**
 * @brief   Function to enable CTU control mode for an ADC unit.
 *
 * @details Enable CTU control mode for an ADC unit.
 *          This function to enable CTU control mode for Adc. When a unit works in CTU control mode,
 *          no other conversions shall run in parallel(Adc). The only conversions occurring shall be
 *          the ones defined in the CTU configuration.
 *
 * @param[in]      AdcLogicalId      ADC Logical Unit Id.
 * @param[in]      UserId            Current UserId
 *
 * @note    The function Service ID[hex]: 0x39.
 *
 * @return       Std_ReturnType  Standard return type.
 * @retval       E_OK:           All checking conditions are valid
 * @retval       E_NOT_OK:       CTU unit is not configured for this ADC unit
 * @api
 */
Std_ReturnType Adc_Ipw_EnableCtuControlMode(Adc_HwUnitType Unit,
                                  uint8 UserId)
{
    uint8 Index;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    boolean AlreadyCall = FALSE;
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];
    const uint8 CtuLogicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuPhyToLogId[CtuPhysicalId];
    Adc_HwUnitType TempAdcPhysicalId;

    (void)Adc_Sar_Ip_SetCtuMode(PhysicalHwUnitId, ADC_SAR_IP_CTU_MODE_CONTROL);

    /* Check are there any Adc Unit which was enabled Ctu Control Mode to avoid duplication of init Bctu */
    for (Index = 0U; Index < ADC_IPW_MAX_HW_UNITS; Index++)
    {
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[Index] == (uint8)STD_ON) /* HW unit enabled on current partition */
        {
            TempAdcPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Index];
            if ((CtuPhysicalId == Adc_Ipw_au8AdcIdToCtuId[TempAdcPhysicalId]) && (TRUE == Adc_axUnitStatus[Index].CtuControlOngoing))
            {
                AlreadyCall = TRUE;
                break;
            }
        }
    }
    /* Mark the unit as CTU control mode is ongoing */
    Adc_axUnitStatus[Unit].CtuControlOngoing = TRUE;

    if (FALSE == AlreadyCall)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
#if (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON)
        /* Stop BCTU triggered mode */
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigTriggerMode[CtuPhysicalId] != NULL_PTR)
        {
            (void)Bctu_Ip_Deinit(CtuPhysicalId);
        }
#endif /* (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) */
        /* Start CTU control */
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigControlMode[CtuLogicalId] != NULL_PTR)
        {
            /* Start BCTU control */
            Bctu_Ip_Init(CtuPhysicalId, Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigControlMode[CtuLogicalId]);
        }
        else
        {
            ReturnValue = (Std_ReturnType)E_NOT_OK;
        }
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
    }

    return ReturnValue;
}

/**
 * @brief   Function to disable CTU control mode for an ADC unit.
 *
 * @details Disable CTU control mode for an ADC unit.
 *          This function to disable CTU control mode for Adc. The other Adc conversions can run in
 *          software trigger normal mode, software trigger injected mode or hardware trigger mode.
 *
 * @param[in]  AdcLogicalId   ADC Logical Unit Id.
 * @param[in]  UserId         Current UserId
 *
 * @note    The function Service ID[hex]: 0x4A.
 *
 * @api
 */
void Adc_Ipw_DisableCtuControlMode(Adc_HwUnitType Unit,
                                   uint8 UserId)
{
    uint8 Index;
    boolean LastCall = TRUE;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[PhysicalHwUnitId];
    Adc_HwUnitType TempPhysicalHwUnitId;

    /* Mark the unit as CTU control mode is not ongoing */
    Adc_axUnitStatus[Unit].CtuControlOngoing = FALSE;

    for (Index = 0U; Index < ADC_IPW_MAX_HW_UNITS; Index++)
    {
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcHwUnitArr[Index] == (uint8)STD_ON) /* HW unit enabled on current partition */
        {
            TempPhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Index];
            if ((TRUE == Adc_axUnitStatus[Index].CtuControlOngoing) && (CtuPhysicalId == Adc_Ipw_au8AdcIdToCtuId[TempPhysicalHwUnitId]))
            {
                LastCall = FALSE;
                break;
            }
        }
    }

    if (TRUE == LastCall)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        /* Stop BCTU control */
        (void)Bctu_Ip_Deinit(CtuPhysicalId);
#if (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON)
        if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigTriggerMode[CtuPhysicalId] != NULL_PTR)
        {
            Bctu_Ip_Init(CtuPhysicalId, Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigTriggerMode[CtuPhysicalId]);
        }
#endif /* (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) */
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
    }

#if (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON)
    if (Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->CtuConfigTriggerMode[CtuPhysicalId] != NULL_PTR)
    {
        (void)Adc_Sar_Ip_SetCtuMode(PhysicalHwUnitId, ADC_SAR_IP_CTU_MODE_TRIGGER);
    }
    else
#endif /* (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) */
    {
        (void)Adc_Sar_Ip_SetCtuMode(PhysicalHwUnitId, ADC_SAR_IP_CTU_MODE_DISABLED);
    }
}

/**
 * @brief   Function to read CTU Fifo data.
 *
 * @details This function returns the conversion result data stored in
 * the BCTU result FIFO at the given index.
 *
 * @param[in]  CtuLogicalId       CTU logical Id
 * @param[in]  FifoIdx            CTU Fifo index
 *
 * @api
 */
uint16 Adc_Ipw_CtuReadFifoData(uint32 CtuLogicalId,
                               uint8 FifoIdx,
                               uint8 UserId)
{
    uint16 Data = 0u;
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

