rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    Data = Bctu_Ip_GetFifoData(CtuPhysicalId, FifoIdx);

    return Data;
}

/**
 * @brief   This function enables notifications selected by the given mask
 * on the selected BCTU instance.
 *
 * @param[in]  UserId             User id
 * @param[in]  CtuLogicalId       CTU logical ID
 * @param[in]  NotificationMask   CTU notifications to be enabled
 *
 * @api
 */
void Adc_Ipw_CtuEnableNotification(const uint8 UserId,
                                   const uint32 CtuLogicalId,
                                   const uint32 NotificationMask)
{
    const uint8 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_EnableNotifications(CtuPhysicalId, NotificationMask);
}

/**
 * @brief   This function disables notifications selected by the given mask
 * on the selected BCTU instance.
 *
 * @param[in]  UserId             User id
 * @param[in]  CtuLogicalId       CTU logical ID
 * @param[in]  NotificationMask   CTU notifications to be disabled
 *
 * @api
 */
void Adc_Ipw_CtuDisableNotification(const uint8 UserId,
                                    const uint32 CtuLogicalId,
                                    const uint32 NotificationMask)
{
    const uint8 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_DisableNotifications(CtuPhysicalId, NotificationMask);
}

/**
 * @brief   Function to enable hw input signal.
 *
 * @details This function clears any eventual pending hw input signals already
 * occurred on the selected trigger and enables new occurrences of the hw input signals
 * to start new conversions
 *
 * @param[in]  CtuLogicalId          CTU logical Id
 * @param[in]  TrigIdx               Trigger index
 * @param[in]  UserId                User id
 *
 */
void Adc_Ipw_CtuEnableHwTrigger(const uint32 CtuLogicalId,
                                const uint8 TrigIdx,
                                const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_EnableHwTrigger(CtuPhysicalId, TrigIdx);
}

/**
 * @brief   Function to disable hw input signal.
 *
 * @details This function prevents the selected BCTU trigger to start
 * new conversions on the occurrence of a hw input signal and also new conversions
 * in an on-going conversion loop (loop flag enabled).
 *
 * @param[in]  CtuLogicalId          CTU logical Id
 * @param[in]  TrigIdx               Trigger index
 * @param[in]  UserId                User id
 *
 */
void Adc_Ipw_CtuDisableHwTrigger(const uint32 CtuLogicalId,
                                 const uint8 TrigIdx,
                                 const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_DisableHwTrigger(CtuPhysicalId, TrigIdx);
}

/**
 * @brief   This function triggers a conversion or list of conversions associated
 * with a trigger index.
 *
 * @param[in]  CtuLogicalId          CTU logical Id
 * @param[in]  TrigIdx               Trigger index
 * @param[in]  UserId                User id
 *
 */
void Adc_Ipw_CtuStartConversion(const uint32 CtuLogicalId,
                                const uint8 TrigIdx,
                                const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_SwTriggerConversion(CtuPhysicalId, TrigIdx);
}

/**
 * @brief   This function returns the current conversion result data
 * corresponding to an adc instance.
 *
 * @param[in]  AdcIdx          Adc Hardware Instance
 *
 */
uint16 Adc_Ipw_CtuReadConvData(const uint8 AdcIdx)
{
    uint16 ConvData;
    const uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[AdcIdx];

    ConvData = Bctu_Ip_GetConvData(CtuPhysicalId, AdcIdx);

    return ConvData;
}

/**
 * @brief   his function returns the full conversion result information
 * corresponding to an adc instance.
 *
 * @param[in]  AdcIdx          Adc Hardware Instance
 * @param[in]  ConvResultPtr   Full information of the conversion result
 *
 */
void Adc_Ipw_CtuReadConvResult(const uint8 AdcIdx, Adc_CtuResultType * ConvResultPtr)
{
    const uint8 CtuPhysicalId = Adc_Ipw_au8AdcIdToCtuId[AdcIdx];

    Bctu_Ip_GetConvResult(CtuPhysicalId, AdcIdx, ConvResultPtr);
}

/**
 * @brief   This function returns the full conversion result information
 * that is stored in the BCTU result FIFO at the given index.
 *
 * @param[in]  CtuLogicalId          CTU logical Id
 * @param[in]  FifoIdx               Fifo index
 * @param[in]  Results               Conversion result
 * @param[in]  UserId                User id
 *
 */
void Adc_Ipw_CtuReadFifoResult(const uint32 CtuLogicalId,
                               const uint8 FifoIdx,
                               Bctu_Ip_FifoResultType * const Results,
                               const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_GetFifoResult(CtuPhysicalId, FifoIdx, Results);
}

/**
 * @brief   Function to enable sw trigger on corresponding trigger index.
 *
 * @details This function gets the full conversion result information, with
 * the conversion data aligned according to the alignment parameter.
 *
 * @param[in]  CtuLogicalId          CTU logical Id
 * @param[in]  FifoIdx               Fifo index
 * @param[in]  Results               Conversion result
 * @param[in]  UserId                User id
 *
 */
void Adc_Ipw_CtuSetFifoWatermark(const uint32 CtuLogicalId,
                                 const uint8 FifoIdx,
                                 const uint8 Watermark,
                                 const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_SetFifoWatermark(CtuPhysicalId, FifoIdx, Watermark);
}

/**
 * @brief   This function sets the conversion list using an array of ListItemType structures.
 * Also marks the element corresponding to the last channel in the array, as last element in the list.
 * Implicitly wrap-around of the array onto the list, if (listSize - startElemIdx) < numArrayElems.
 *
 * @param[in]  CtuLogicalId          CTU logical Id
 * @param[in]  StartListElemIdx      Start command address
 * @param[in]  AdcCmdArray           Command list
 * @param[in]  NumCmds               Number of command
 * @param[in]  UserId                User id
 *
 */
void Adc_Ipw_CtuSetList(const uint32 CtuLogicalId,
                        const uint8 StartListElemIdx,
                        const Bctu_Ip_ListItemType * const ConvListItems,
                        const uint8 NumItems,
                        const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

    Bctu_Ip_ConfigChanList(CtuPhysicalId, StartListElemIdx, ConvListItems, NumItems);
}

/**
 * @brief   Attempts to configure the first address of the command list
 * associated with an internal trigger or channel. If there is an on-going conversion started via
 * target trigger, it only disables the trigger (will ignore any new triggers)
 * and returns error code.
 *
 * @param[in]  CtuLogicalId         CTU logical Id
 * @param[in]  TrigIdx              Trigger index
 * @param[in]  AdcCmdAddress        First command address
 * @param[in]  UserId               User id
 *
 */
void Adc_Ipw_CtuSetListPointer(const uint32 CtuLogicalId,
                               const uint32 TrigIdx,
                               const uint8 ChnOrListAddr,
                               const uint8 UserId)
{
    const uint32 CtuPhysicalId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.CtuLogToPhyId[CtuLogicalId];

