rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw.c
    (void)Bctu_Ip_SetTriggerChnListAddr(CtuPhysicalId, (uint8)TrigIdx, TRUE, ChnOrListAddr);
}
#endif /* ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON */

#if ADC_SAR_IP_HAS_TEMPSENSE_CHN
#if (ADC_ENABLE_TEMPSENSE_API == STD_ON)
/**
 * @brief Get the temperature on chip directly.
 *
 * @details This function starts a normal software conversion on tempsense channel and calculates
 *          the temperature on chip from the data conversion
 *
 * @param[in]  Unit                ADC Unit Id.
 * @param[in]  TempInstance     Tempsense Unit Id.
 * @param[out] TempSenseVal       Temperature value on chip.
 *
 * @return         Std_ReturnType  Standard return type.
 *                 E_OK:           Temperature read successfully
 *                 E_NOT_OK:       An error occurred
 *
 * @api
 */
Std_ReturnType Adc_Ipw_TempSenseGetTemp(Adc_HwUnitType Unit,
                                        const uint32 TempInstance,
                                        uint16 * const TempSenseVal,
                                        uint8 UserId)
{
    Std_ReturnType ReturnStatus = (Std_ReturnType)E_NOT_OK;
    Adc_Sar_Ip_StatusType IpStatus;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    IpStatus = Adc_Sar_Ip_TempSenseGetTemp(PhysicalHwUnitId, TempInstance, TempSenseVal);
    if (IpStatus == ADC_SAR_IP_STATUS_SUCCESS)
    {
        ReturnStatus = (Std_ReturnType)E_OK;
    }

    return ReturnStatus;
}
#endif /* (ADC_ENABLE_TEMPSENSE_API == STD_ON) */
#endif /* ADC_SAR_IP_HAS_TEMPSENSE_CHN */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
/**
 * @brief Get the Hw Trigger index.
 *
 * @details This function returns the Hw Trigger index in AdcHwTrigger array.
 *
 * @param[in]  TriggerSource      Trigger source
 * @param[in]  UserId             Current UserId.
 * @param[out] TriggerIndex       Trigger index
 *
 * @return         boolean         TRUE if trigger source is within configured triggers / FALSE otherwise
 *
 */
boolean Adc_Ipw_MapCTUTriggerIndex(Adc_HwTriggerTimerType TriggerSource,
                                   uint8 UserId,
                                   uint8 * TriggerIndex)
{
    uint8 TriggerIdx;
    uint8 TrigIdx;
    boolean Found = FALSE;
    const uint8 * HwTriggerSource = &Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwTriggIndex[0U];

    *TriggerIndex = 0U;
    for (TriggerIdx = 0U; TriggerIdx < ADC_IPW_MAX_HARDWARE_TRIGGERS; TriggerIdx++)
    {
        TrigIdx = HwTriggerSource[TriggerIdx];
        if (TriggerSource == TrigIdx)
        {
            Found = TRUE;
            *TriggerIndex = TriggerIdx;
            break;
        }
    }
    return Found;
}
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) */

/**
* @brief        This function returns the id of the Partition from which it is called.
* @details      This function returns the result of the OsIf_GetUserID OS function
*               (which is called in the appropriate context depending on USER MODE)
*               If the multipartition feature is disabled for ADC, this function will return 0.
*
* @param[in]    void
*
* @return       uint8   the Partition Id number.
*/
uint8 Adc_GetUserID(void)
{
    uint8 PartitionValue;

#if (ADC_MULTIPARTITION_SUPPORT == STD_ON)
    PartitionValue = (uint8)OsIf_GetUserId();
#else
    PartitionValue = 0U;
#endif /* (ADC_MULTIPARTITION_SUPPORT == STD_ON) */
    return PartitionValue;
}
#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */
